-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/sam/repos/econ513/03_explore.log
  log type:  text
 opened on:  30 Aug 2022, 16:27:31

. 
. * load nlswork data (National Longitudinal Survey of Young Women, 14-24 years
. * old in 1968)
. use "data/nlswork.dta", clear
(National Longitudinal Survey of Young Women, 14-24 years old in 1968)

. 
. * describe the variables by type
. describe

Contains data from data/nlswork.dta
 Observations:        28,534                  National Longitudinal Survey of Young Women,
                                                14-24 years old in 1968
    Variables:            21                  30 Aug 2022 16:15
                                              (_dta has notes)
-----------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-----------------------------------------------------------------------------------------------
idcode          int     %8.0g                 NLS ID
year            byte    %8.0g                 Interview year
birth_yr        byte    %8.0g                 Birth year
age             byte    %8.0g                 Age in current year
race            byte    %8.0g      racelbl    Race
msp             byte    %8.0g                 1 if married, spouse present
nev_mar         byte    %8.0g                 1 if never married
grade           byte    %8.0g                 Current grade completed
collgrad        byte    %8.0g                 1 if college graduate
not_smsa        byte    %8.0g                 1 if not SMSA
c_city          byte    %8.0g                 1 if central city
south           byte    %8.0g                 1 if south
ind_code        byte    %8.0g                 Industry of employment
occ_code        byte    %8.0g                 Occupation
union           byte    %8.0g                 1 if union
wks_ue          byte    %8.0g                 Weeks unemployed last year
ttl_exp         float   %9.0g                 Total work experience
tenure          float   %9.0g                 Job tenure, in years
hours           int     %8.0g                 Usual hours worked
wks_work        int     %8.0g                 Weeks worked last year
ln_wage         float   %9.0g                 ln(wage/GNP deflator)
-----------------------------------------------------------------------------------------------
Sorted by: idcode  year

. 
. * generate summary statistucs
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      idcode |     28,534    2601.284    1487.359          1       5159
        year |     28,534    77.95865    6.383879         68         88
    birth_yr |     28,534    48.08509    3.012837         41         54
         age |     28,510    29.04511    6.700584         14         46
        race |     28,534    1.303392    .4822773          1          3
-------------+---------------------------------------------------------
         msp |     28,518    .6029175    .4893019          0          1
     nev_mar |     28,518    .2296795    .4206341          0          1
       grade |     28,532    12.53259    2.323905          0         18
    collgrad |     28,534    .1680451    .3739129          0          1
    not_smsa |     28,526    .2824441    .4501961          0          1
-------------+---------------------------------------------------------
      c_city |     28,526     .357218    .4791882          0          1
       south |     28,526    .4095562    .4917605          0          1
    ind_code |     28,193    7.692973    2.994025          1         12
    occ_code |     28,413    4.777672    3.065435          1         13
       union |     19,238    .2344319    .4236542          0          1
-------------+---------------------------------------------------------
      wks_ue |     22,830    2.548095    7.294463          0         76
     ttl_exp |     28,534    6.215316    4.652117          0   28.88461
      tenure |     28,101    3.123836    3.751409          0   25.91667
       hours |     28,467    36.55956    9.869623          1        168
    wks_work |     27,831    53.98933    29.03232          0        104
-------------+---------------------------------------------------------
     ln_wage |     28,534    1.674907    .4780935          0   5.263916

. 
. * if the data is in native Stata format, often then is a codebook available with
. * variable definitions
. * for single variables
. codebook ln_wage

-----------------------------------------------------------------------------------------------
ln_wage                                                                   ln(wage/GNP deflator)
-----------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [0,5.263916]                  Units: 1.000e-09
         Unique values: 8,173                     Missing .: 0/28,534

                  Mean: 1.67491
             Std. dev.: .478093

           Percentiles:     10%       25%       50%       75%       90%
                         1.1661    1.3615   1.64054   1.96408   2.27569

. 
. * run without parameters to access the entire codebook
. * codebook
. 
. * generate histogram for single variable, shows number of missing values
. inspect tenure

tenure:  Job tenure, in years                   Number of observations
-----------------------------          ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero            1,248         1,248             -
|  #                         Positive       26,853         2,092        24,761
|  #                                   -----------   -----------   -----------
|  #                         Total          28,101         3,340        24,761
|  #   #   .   .   .         Missing           433
+----------------------                -----------
0              25.91667                     28,534
(More than 99 unique values)

. inspect tenure if !missing(tenure)

tenure:  Job tenure, in years                   Number of observations
-----------------------------          ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero            1,248         1,248             -
|  #                         Positive       26,853         2,092        24,761
|  #                                   -----------   -----------   -----------
|  #                         Total          28,101         3,340        24,761
|  #   #   .   .   .         Missing             -
+----------------------                -----------
0              25.91667                     28,101
(More than 99 unique values)

. 
. * list the first few rows of data for several variables
. list ln_wage age collgrad grade in 1/5

     +-----------------------------------+
     |  ln_wage   age   collgrad   grade |
     |-----------------------------------|
  1. | 1.451214    18          0      12 |
  2. |  1.02862    19          0      12 |
  3. | 1.589977    20          0      12 |
  4. | 1.780273    21          0      12 |
  5. | 1.777012    23          0      12 |
     +-----------------------------------+

. 
. * conditional listing of rows
. list ln_wage if missing(age)

       +----------+
       |  ln_wage |
       |----------|
 1676. | 2.334283 |
 2026. | 2.154093 |
 3574. | 2.114449 |
 9235. | 1.485207 |
10375. | 2.382999 |
       |----------|
10946. | 1.468965 |
11739. | 1.291193 |
13491. | 1.980502 |
13506. | 2.191122 |
13524. | 1.341422 |
       |----------|
14247. | 1.361601 |
14322. |  2.23707 |
15333. | 2.047121 |
15546. | .4559097 |
16140. | 1.451214 |
       |----------|
17999. | 1.836159 |
18199. | 1.361601 |
19660. | 1.157089 |
22089. |  1.21765 |
24132. | 1.392373 |
       |----------|
25236. | 1.157089 |
25588. | 1.539409 |
25765. | 1.412517 |
28449. | 1.787686 |
       +----------+

. list ind_code if !missing(occ_code) & ttl_exp > 10

       +----------+
       | ind_code |
       |----------|
   12. |        5 |
   22. |        4 |
   23. |        4 |
   24. |        4 |
   35. |        4 |
       |----------|
   36. |        4 |
   37. |        4 |
   38. |        4 |
   39. |        4 |
   48. |       11 |
       |----------|
   49. |       11 |
   50. |       11 |
   61. |        4 |
   72. |        4 |
   73. |        4 |
       |----------|
   74. |        4 |
   75. |        4 |
   76. |        4 |
   92. |        5 |
   93. |        5 |
       |----------|
   94. |        5 |
   95. |        5 |
   96. |        5 |
   97. |        5 |
  107. |       11 |
       |----------|
  108. |       11 |
  117. |       11 |
  118. |       11 |
  119. |       11 |
  125. |       11 |
       |----------|
  126. |       11 |
  127. |       11 |
  128. |       11 |
  129. |       11 |
  138. |       11 |
       |----------|
  139. |       11 |
  140. |       11 |
  141. |       11 |
  142. |       11 |
  162. |       11 |
       |----------|
  163. |       11 |
  164. |       11 |
  174. |       11 |
  175. |       11 |
  176. |       11 |
       |----------|
  177. |       11 |
  193. |       11 |
  194. |       11 |
  195. |       11 |
  200. |       11 |
       |----------|
  201. |       11 |
  212. |       11 |
  213. |       11 |
  214. |       11 |
  215. |       11 |
       |----------|
  216. |       11 |
  225. |       11 |
  226. |       11 |
  227. |       11 |
  228. |       11 |
       |----------|
  229. |       11 |
  234. |       11 |
  235. |       11 |
  260. |        8 |
  290. |       12 |
       |----------|
  291. |       12 |
  292. |       12 |
  293. |       12 |
  300. |        5 |
  301. |        5 |
       |----------|
  302. |        5 |
  303. |        5 |
  304. |        5 |
  327. |       11 |
  334. |       11 |
       |----------|
  356. |        6 |
  357. |        6 |
  359. |       11 |
  360. |       11 |
  396. |       11 |
       |----------|
  418. |        6 |
  419. |        6 |
  426. |       11 |
  438. |        5 |
  439. |        5 |
       |----------|
  448. |        4 |
  464. |        4 |
  465. |        4 |
  466. |        4 |
  467. |        4 |
       |----------|
  478. |        4 |
  479. |        4 |
  480. |        4 |
  481. |        4 |
  495. |        7 |
       |----------|
  496. |        7 |
  497. |        7 |
  498. |        7 |
  514. |       11 |
  515. |       11 |
       |----------|
  516. |       11 |
  529. |       10 |
  530. |       10 |
  531. |       10 |
  532. |       10 |
       |----------|
  533. |       10 |
  534. |       10 |
  594. |       12 |
  595. |       12 |
  596. |       12 |
       |----------|
  597. |       12 |
  598. |       12 |
  629. |        4 |
  630. |        4 |
  631. |        4 |
       |----------|
  647. |       12 |
  669. |        5 |
  670. |        5 |
  671. |        5 |
  672. |        5 |
       |----------|
  673. |        5 |
  674. |        5 |
  691. |       11 |
  692. |       11 |
  693. |       11 |
       |----------|
  694. |       11 |
  695. |       11 |
  696. |       11 |
  705. |        7 |
  706. |        7 |
       |----------|
  707. |        7 |
  708. |        7 |
  709. |        7 |
  710. |        7 |
  720. |       11 |
       |----------|
  721. |       12 |
  722. |       11 |
  737. |       11 |
  738. |       11 |
  748. |        4 |
       |----------|
  770. |        7 |
  781. |       11 |
  782. |       11 |
  786. |       11 |
  787. |       11 |
       |----------|
  788. |       11 |
  789. |       11 |
  802. |        8 |
  803. |        8 |
  804. |        8 |
       |----------|
  805. |        1 |
  810. |        8 |
  811. |        8 |
  833. |       11 |
  834. |       11 |
       |----------|
  835. |       11 |
  843. |        7 |
  844. |        7 |
  845. |        7 |
  846. |        7 |
       |----------|
  860. |        4 |
  861. |        4 |
  870. |        7 |
  871. |        7 |
  872. |        7 |
       |----------|
  873. |        7 |
  874. |        7 |
  893. |        4 |
  894. |        4 |
  895. |        4 |
       |----------|
  896. |        4 |
  897. |        4 |
  907. |       11 |
  909. |        3 |
  910. |        3 |
       |----------|
  911. |        3 |
  912. |        3 |
  916. |       11 |
  917. |       11 |
  920. |       11 |
       |----------|
  921. |       11 |
  933. |        7 |
  934. |        7 |
  935. |        7 |
  936. |        7 |
       |----------|
  943. |       11 |
  944. |       11 |
  945. |       11 |
  946. |       11 |
  955. |        9 |
       |----------|
  956. |        9 |
  965. |        7 |
  966. |        7 |
  967. |        7 |
  968. |        7 |
       |----------|
  969. |        7 |
  970. |        7 |
  982. |       12 |
  983. |       12 |
 1006. |        4 |
       |----------|
 1007. |        4 |
 1008. |        4 |
 1009. |        4 |
 1010. |        4 |
 1018. |       11 |
       |----------|
 1019. |       11 |
 1023. |        7 |
 1024. |        7 |
 1046. |        4 |
 1047. |        4 |
       |----------|
 1052. |        5 |
 1067. |        5 |
 1068. |        1 |
 1069. |        1 |
 1078. |        4 |
       |----------|
 1079. |        4 |
 1080. |        4 |
 1099. |        5 |
 1100. |        5 |
 1101. |        5 |
       |----------|
 1102. |        6 |
 1110. |        7 |
 1111. |        7 |
 1112. |        7 |
 1113. |        7 |
       |----------|
 1114. |        7 |
 1123. |        8 |
 1124. |       11 |
 1125. |       11 |
 1128. |       11 |
       |----------|
 1129. |       11 |
 1130. |       11 |
 1148. |        4 |
 1149. |        4 |
 1150. |        4 |
       |----------|
 1151. |        4 |
 1152. |        4 |
 1160. |       12 |
 1161. |       12 |
 1168. |       11 |
       |----------|
 1169. |       11 |
 1170. |       11 |
 1171. |       11 |
 1181. |        4 |
 1182. |        4 |
       |----------|
 1183. |        4 |
 1185. |        4 |
 1194. |        6 |
 1195. |        6 |
 1196. |        6 |
       |----------|
 1197. |        6 |
 1214. |       11 |
 1219. |       11 |
 1220. |       11 |
 1221. |       11 |
       |----------|
 1222. |       11 |
 1223. |       11 |
 1233. |        8 |
 1234. |        8 |
 1235. |        8 |
       |----------|
 1246. |        4 |
 1247. |        4 |
 1254. |        8 |
 1255. |       10 |
 1256. |       11 |
       |----------|
 1257. |       10 |
 1260. |       11 |
 1261. |        4 |
 1274. |        4 |
 1275. |        4 |
       |----------|
 1276. |        4 |
 1277. |        4 |
 1293. |        4 |
 1294. |       11 |
 1300. |        8 |
       |----------|
 1313. |       11 |
 1314. |       11 |
 1315. |       11 |
 1330. |       11 |
 1331. |       11 |
       |----------|
 1349. |        5 |
 1350. |        5 |
 1351. |        5 |
 1352. |       11 |
 1353. |       11 |
       |----------|
 1354. |       12 |
 1355. |       12 |
 1356. |       12 |
 1357. |        7 |
 1384. |       12 |
       |----------|
 1385. |       12 |
 1386. |       12 |
 1387. |       12 |
 1388. |       12 |
 1404. |       11 |
       |----------|
 1405. |       11 |
 1406. |       11 |
 1407. |        5 |
 1408. |        5 |
 1409. |        5 |
       |----------|
 1410. |        5 |
 1411. |        5 |
 1412. |        5 |
 1420. |       11 |
 1421. |       11 |
       |----------|
 1423. |        5 |
 1424. |        5 |
 1425. |        5 |
 1426. |        5 |
 1433. |       11 |
       |----------|
 1440. |       11 |
 1441. |       11 |
 1442. |       11 |
 1449. |       11 |
 1470. |       11 |
       |----------|
 1474. |        6 |
 1509. |        6 |
 1510. |        6 |
 1511. |        6 |
 1512. |        6 |
       |----------|
 1520. |       11 |
 1525. |        6 |
 1526. |        6 |
 1527. |        4 |
 1528. |        6 |
       |----------|
 1554. |        6 |
 1570. |        7 |
 1571. |        7 |
 1572. |        7 |
 1573. |        3 |
       |----------|
 1574. |        3 |
 1597. |        6 |
 1598. |        6 |
 1599. |        6 |
 1600. |        6 |
       |----------|
 1610. |       11 |
 1611. |       11 |
 1612. |       11 |
 1622. |        7 |
 1623. |        7 |
       |----------|
 1624. |        7 |
 1630. |       11 |
 1631. |       11 |
 1632. |       11 |
 1643. |       11 |
       |----------|
 1651. |       11 |
 1652. |       11 |
 1653. |       11 |
 1654. |       11 |
 1655. |       11 |
       |----------|
 1662. |        5 |
 1663. |        6 |
 1664. |        6 |
 1665. |       11 |
 1674. |        8 |
       |----------|
 1675. |       11 |
 1676. |       11 |
 1695. |       11 |
 1702. |        7 |
 1703. |        7 |
       |----------|
 1704. |        7 |
 1735. |        7 |
 1736. |        7 |
 1737. |        7 |
 1738. |        7 |
       |----------|
 1740. |        8 |
 1741. |        6 |
 1759. |        9 |
 1760. |        7 |
 1761. |        5 |
       |----------|
 1762. |        5 |
 1777. |       11 |
 1778. |       11 |
 1781. |       11 |
 1782. |       12 |
       |----------|
 1783. |       11 |
 1784. |       11 |
 1785. |       11 |
 1790. |        4 |
 1791. |        4 |
       |----------|
 1798. |        4 |
 1804. |       11 |
 1805. |       11 |
 1806. |       11 |
 1825. |       11 |
       |----------|
 1828. |        4 |
 1829. |        4 |
 1830. |        4 |
 1831. |        4 |
 1832. |        4 |
       |----------|
 1833. |        4 |
 1860. |        6 |
 1861. |        6 |
 1862. |        6 |
 1863. |        4 |
       |----------|
 1864. |        4 |
 1865. |        6 |
 1882. |       11 |
 1895. |        7 |
 1896. |        7 |
       |----------|
 1897. |        7 |
 1898. |        7 |
 1899. |        7 |
 1903. |        4 |
 1904. |        4 |
       |----------|
 1914. |        7 |
 1915. |        7 |
 1916. |       11 |
 1917. |       11 |
 1918. |       11 |
       |----------|
 1929. |        7 |
 1930. |        7 |
 1931. |        7 |
 1938. |        6 |
 1953. |        6 |
       |----------|
 1965. |        8 |
 1970. |        7 |
 1971. |        7 |
 1972. |        . |
 1973. |        7 |
       |----------|
 1974. |        7 |
 1975. |        7 |
 1976. |        7 |
 1977. |        7 |
 1978. |        7 |
       |----------|
 1979. |        7 |
 1980. |        7 |
 1983. |       11 |
 1988. |        4 |
 1989. |        4 |
       |----------|
 1990. |        4 |
 2008. |        6 |
 2009. |        4 |
 2015. |        4 |
 2016. |        4 |
       |----------|
 2025. |        6 |
 2026. |        7 |
 2027. |        7 |
 2036. |       11 |
 2045. |        6 |
       |----------|
 2046. |        6 |
 2061. |        4 |
 2062. |        4 |
 2063. |        4 |
 2064. |        4 |
       |----------|
 2065. |        4 |
 2071. |        7 |
 2072. |        7 |
 2073. |        7 |
 2081. |        6 |
       |----------|
 2082. |        6 |
 2083. |        6 |
 2084. |        6 |
 2085. |        6 |
 2086. |        6 |
       |----------|
 2087. |        6 |
 2088. |        6 |
 2095. |        7 |
 2096. |        7 |
 2097. |        7 |
       |----------|
 2098. |        7 |
 2112. |        6 |
 2113. |        5 |
 2114. |        5 |
 2115. |        3 |
       |----------|
 2116. |        5 |
 2117. |       12 |
 2118. |        4 |
 2138. |        4 |
 2139. |        7 |
       |----------|
 2183. |        4 |
 2184. |        4 |
 2185. |        4 |
 2186. |        4 |
 2187. |        4 |
       |----------|
 2194. |       11 |
 2195. |       11 |
 2203. |        3 |
 2204. |        3 |
 2205. |        4 |
       |----------|
 2212. |        6 |
 2218. |        4 |
 2219. |        4 |
 2220. |        4 |
 2221. |        4 |
       |----------|
 2222. |        4 |
 2238. |        4 |
 2239. |        4 |
 2240. |        4 |
 2247. |       12 |
       |----------|
 2259. |        4 |
 2260. |        4 |
 2273. |       11 |
 2274. |       11 |
 2280. |       11 |
       |----------|
 2281. |       11 |
 2298. |        7 |
 2299. |        7 |
 2300. |        7 |
 2327. |       11 |
       |----------|
 2337. |        9 |
 2338. |        9 |
 2347. |        9 |
 2348. |        9 |
 2365. |        4 |
       |----------|
 2366. |       11 |
 2367. |       11 |
 2368. |       11 |
 2389. |       12 |
 2390. |       12 |
       |----------|
 2391. |       12 |
 2392. |       12 |
 2405. |        7 |
 2406. |        7 |
 2424. |       12 |
       |----------|
 2425. |       12 |
 2426. |       12 |
 2427. |       12 |
 2428. |       12 |
 2429. |       12 |
       |----------|
 2447. |        7 |
 2448. |        7 |
 2464. |        6 |
 2477. |       11 |
 2478. |       11 |
       |----------|
 2479. |       11 |
 2495. |       11 |
 2496. |       11 |
 2497. |       11 |
 2498. |       11 |
       |----------|
 2499. |       11 |
 2500. |       11 |
 2534. |        9 |
 2559. |       11 |
 2560. |       11 |
       |----------|
 2561. |       11 |
 2562. |       11 |
 2563. |       11 |
 2564. |       11 |
 2573. |        4 |
       |----------|
 2589. |       12 |
 2590. |       12 |
 2599. |       12 |
 2600. |       12 |
 2601. |       12 |
       |----------|
 2625. |        6 |
 2649. |       12 |
 2650. |       12 |
 2651. |       12 |
 2652. |       12 |
       |----------|
 2653. |       11 |
 2664. |       11 |
 2665. |       11 |
 2666. |       11 |
 2667. |       11 |
       |----------|
 2673. |       11 |
 2674. |        9 |
 2690. |        7 |
 2691. |       11 |
 2692. |       11 |
       |----------|
 2699. |        9 |
 2700. |       10 |
 2714. |        2 |
 2715. |        5 |
 2716. |        5 |
       |----------|
 2717. |        5 |
 2731. |       12 |
 2732. |       12 |
 2738. |       11 |
 2739. |       11 |
       |----------|
 2740. |       11 |
 2750. |       11 |
 2751. |       11 |
 2752. |       11 |
 2753. |       11 |
       |----------|
 2754. |       11 |
 2755. |       11 |
 2756. |        6 |
 2785. |       11 |
 2786. |       11 |
       |----------|
 2787. |       11 |
 2788. |       11 |
 2794. |       11 |
 2795. |       11 |
 2796. |       11 |
       |----------|
 2797. |       11 |
 2798. |       11 |
 2799. |       11 |
 2812. |       11 |
 2825. |        4 |
       |----------|
 2826. |        4 |
 2843. |       11 |
 2844. |       11 |
 2858. |        6 |
 2859. |        6 |
       |----------|
 2860. |        5 |
 2861. |        6 |
 2862. |        6 |
 2871. |       11 |
 2872. |       11 |
       |----------|
 2906. |        4 |
 2907. |        6 |
 2908. |       11 |
 2909. |       11 |
 2910. |        6 |
       |----------|
 2911. |        . |
 2912. |        6 |
 2913. |        6 |
 2914. |       11 |
 2915. |       11 |
       |----------|
 2916. |       11 |
 2923. |       12 |
 2925. |        7 |
 2926. |        7 |
 2927. |        7 |
       |----------|
 2928. |        7 |
 2931. |       11 |
 2942. |        4 |
 2943. |        7 |
 2954. |       11 |
       |----------|
 2980. |        6 |
 2990. |        7 |
 2995. |        3 |
 2996. |        3 |
 2997. |        3 |
       |----------|
 2998. |        3 |
 2999. |        3 |
 3000. |        3 |
 3005. |       11 |
 3006. |       11 |
       |----------|
 3007. |       11 |
 3021. |        8 |
 3022. |        4 |
 3023. |        4 |
 3038. |        3 |
       |----------|
 3039. |        3 |
 3040. |        3 |
 3041. |        7 |
 3042. |        3 |
 3050. |       11 |
       |----------|
 3052. |       11 |
 3061. |       11 |
 3062. |       11 |
 3063. |        8 |
 3064. |        8 |
       |----------|
 3065. |        8 |
 3122. |        4 |
 3123. |        4 |
 3149. |        4 |
 3150. |        4 |
       |----------|
 3151. |        4 |
 3158. |       12 |
 3159. |       12 |
 3160. |       12 |
 3168. |       11 |
       |----------|
 3169. |       11 |
 3170. |       11 |
 3171. |       11 |
 3172. |       11 |
 3185. |       11 |
       |----------|
 3186. |       11 |
 3187. |       11 |
 3224. |        7 |
 3225. |        7 |
 3234. |       12 |
       |----------|
 3235. |       12 |
 3236. |       12 |
 3268. |        7 |
 3269. |        7 |
 3270. |        7 |
       |----------|
 3271. |        7 |
 3272. |        7 |
 3289. |        1 |
 3290. |        7 |
 3291. |        7 |
       |----------|
 3312. |        5 |
 3313. |        5 |
 3314. |        5 |
 3323. |       11 |
 3324. |       11 |
       |----------|
 3325. |       11 |
 3370. |        4 |
 3371. |        4 |
 3372. |        3 |
 3407. |       11 |
       |----------|
 3408. |       11 |
 3415. |        8 |
 3417. |       11 |
 3418. |        7 |
 3419. |        7 |
       |----------|
 3422. |       11 |
 3423. |       11 |
 3436. |        9 |
 3437. |        9 |
 3438. |        9 |
       |----------|
 3439. |        8 |
 3440. |       11 |
 3441. |        8 |
 3445. |       11 |
 3446. |       11 |
       |----------|
 3447. |       11 |
 3469. |        7 |
 3474. |       11 |
 3490. |       11 |
 3494. |       11 |
       |----------|
 3513. |       10 |
 3514. |       10 |
 3515. |       10 |
 3532. |        5 |
 3533. |        5 |
       |----------|
 3534. |        5 |
 3535. |        5 |
 3536. |        5 |
 3537. |        5 |
 3545. |        4 |
       |----------|
 3546. |        4 |
 3565. |       11 |
 3566. |       11 |
 3582. |        7 |
 3587. |        4 |
       |----------|
 3596. |        7 |
 3597. |        7 |
 3605. |        6 |
 3606. |        6 |
 3607. |        6 |
       |----------|
 3608. |        6 |
 3632. |       11 |
 3640. |        5 |
 3641. |        5 |
 3642. |        5 |
       |----------|
 3666. |        7 |
 3667. |        7 |
 3678. |       11 |
 3679. |       11 |
 3690. |       11 |
       |----------|
 3691. |       11 |
 3692. |       11 |
 3693. |       11 |
 3695. |       11 |
 3696. |       11 |
       |----------|
 3697. |       11 |
 3702. |        7 |
 3719. |        6 |
 3737. |        4 |
 3738. |        4 |
       |----------|
 3760. |        6 |
 3761. |        6 |
 3762. |        6 |
 3763. |        6 |
 3764. |        6 |
       |----------|
 3765. |        6 |
 3793. |        7 |
 3794. |        7 |
 3795. |        7 |
 3805. |        7 |
       |----------|
 3806. |        7 |
 3807. |        7 |
 3808. |        7 |
 3809. |        7 |
 3810. |        7 |
       |----------|
 3821. |        5 |
 3822. |        5 |
 3823. |        5 |
 3831. |        7 |
 3832. |        9 |
       |----------|
 3833. |        9 |
 3834. |        7 |
 3835. |        9 |
 3836. |       12 |
 3843. |        6 |
       |----------|
 3844. |        6 |
 3845. |        6 |
 3846. |        6 |
 3856. |       11 |
 3867. |        7 |
       |----------|
 3868. |        7 |
 3879. |       11 |
 3880. |       11 |
 3889. |        5 |
 3890. |        5 |
       |----------|
 3891. |        5 |
 3899. |        6 |
 3923. |       11 |
 3924. |       11 |
 3939. |        5 |
       |----------|
 3940. |        5 |
 3941. |        5 |
 3942. |        5 |
 3943. |        5 |
 3944. |        5 |
       |----------|
 3950. |        5 |
 3951. |        5 |
 3952. |        5 |
 3953. |        5 |
 3954. |        5 |
       |----------|
 3962. |        7 |
 3963. |        7 |
 3996. |       11 |
 3997. |       11 |
 3998. |       11 |
       |----------|
 3999. |       11 |
 4007. |       12 |
 4008. |       12 |
 4018. |        7 |
 4019. |        7 |
       |----------|
 4020. |        7 |
 4021. |        7 |
 4039. |       11 |
 4040. |       11 |
 4041. |       11 |
       |----------|
 4063. |        6 |
 4064. |        6 |
 4075. |        4 |
 4076. |        6 |
 4079. |       11 |
       |----------|
 4080. |       11 |
 4081. |       11 |
 4082. |       11 |
 4083. |       11 |
 4084. |        6 |
       |----------|
 4087. |       11 |
 4088. |       11 |
 4089. |       11 |
 4097. |        4 |
 4098. |        4 |
       |----------|
 4099. |        4 |
 4103. |        6 |
 4111. |       11 |
 4112. |       11 |
 4113. |        4 |
       |----------|
 4114. |        4 |
 4122. |       11 |
 4123. |       11 |
 4124. |       11 |
 4132. |        6 |
       |----------|
 4133. |        4 |
 4134. |       11 |
 4144. |       11 |
 4145. |       11 |
 4146. |       11 |
       |----------|
 4149. |       11 |
 4150. |       11 |
 4166. |       11 |
 4167. |       11 |
 4168. |       11 |
       |----------|
 4176. |        6 |
 4200. |        5 |
 4201. |        5 |
 4202. |        5 |
 4232. |       12 |
       |----------|
 4233. |        . |
 4234. |       12 |
 4235. |       12 |
 4236. |       12 |
 4237. |       12 |
       |----------|
 4248. |        8 |
 4273. |        4 |
 4274. |        4 |
 4285. |        6 |
 4292. |        5 |
       |----------|
 4293. |        5 |
 4294. |        5 |
 4295. |        5 |
 4296. |        5 |
 4297. |        5 |
       |----------|
 4298. |        5 |
 4299. |        5 |
 4306. |        5 |
 4307. |        5 |
 4308. |        5 |
       |----------|
 4367. |       11 |
 4368. |       11 |
 4376. |        4 |
 4377. |        4 |
 4378. |        4 |
       |----------|
 4380. |       11 |
 4381. |       11 |
 4382. |       11 |
 4383. |       11 |
 4394. |        8 |
       |----------|
 4395. |        6 |
 4396. |        6 |
 4397. |        6 |
 4415. |        7 |
 4416. |        7 |
       |----------|
 4417. |        7 |
 4430. |        5 |
 4431. |        5 |
 4432. |        5 |
 4436. |       11 |
       |----------|
 4437. |        8 |
 4438. |        . |
 4453. |       12 |
 4454. |       12 |
 4455. |       12 |
       |----------|
 4474. |       12 |
 4475. |       12 |
 4476. |       12 |
 4477. |       12 |
 4478. |       12 |
       |----------|
 4479. |       12 |
 4490. |        4 |
 4491. |        4 |
 4492. |        4 |
 4502. |       11 |
       |----------|
 4503. |       11 |
 4504. |       12 |
 4505. |       12 |
 4506. |       12 |
 4507. |       12 |
       |----------|
 4517. |        3 |
 4518. |        3 |
 4536. |        6 |
 4537. |        6 |
 4552. |        6 |
       |----------|
 4562. |       12 |
 4573. |        9 |
 4574. |        9 |
 4575. |        6 |
 4576. |        9 |
       |----------|
 4589. |        6 |
 4590. |        6 |
 4591. |        6 |
 4592. |        6 |
 4593. |        6 |
       |----------|
 4603. |        5 |
 4604. |        5 |
 4605. |        5 |
 4606. |        5 |
 4614. |        9 |
       |----------|
 4615. |        9 |
 4616. |        9 |
 4617. |        9 |
 4618. |        9 |
 4626. |       11 |
       |----------|
 4627. |       11 |
 4628. |       11 |
 4629. |       11 |
 4630. |       11 |
 4637. |        9 |
       |----------|
 4668. |       11 |
 4669. |       11 |
 4670. |       11 |
 4671. |       11 |
 4672. |       11 |
       |----------|
 4673. |       11 |
 4674. |       11 |
 4692. |       11 |
 4693. |       11 |
 4694. |       11 |
       |----------|
 4710. |        4 |
 4723. |       11 |
 4724. |       11 |
 4731. |       11 |
 4732. |       11 |
       |----------|
 4733. |       11 |
 4744. |        4 |
 4745. |        4 |
 4746. |        4 |
 4755. |       12 |
       |----------|
 4776. |        7 |
 4777. |       11 |
 4778. |       11 |
 4786. |        6 |
 4805. |       11 |
       |----------|
 4806. |       11 |
 4807. |       11 |
 4808. |       11 |
 4817. |       11 |
 4852. |        7 |
       |----------|
 4857. |       11 |
 4858. |       11 |
 4859. |       11 |
 4866. |        7 |
 4867. |        7 |
       |----------|
 4868. |        7 |
 4889. |       11 |
 4912. |       11 |
 4913. |       11 |
 4914. |       11 |
       |----------|
 4921. |        7 |
 4933. |       11 |
 4934. |       11 |
 4944. |        4 |
 4952. |       11 |
       |----------|
 4953. |       11 |
 4954. |       11 |
 4965. |       12 |
 4966. |       11 |
 4967. |       12 |
       |----------|
 4968. |       12 |
 4969. |       11 |
 4970. |       11 |
 4971. |       11 |
 4972. |       11 |
       |----------|
 4973. |        4 |
 4980. |        5 |
 4981. |        8 |
 4982. |        5 |
 4983. |        6 |
       |----------|
 5005. |       10 |
 5006. |       11 |
 5007. |       11 |
 5023. |        4 |
 5024. |        4 |
       |----------|
 5025. |        4 |
 5026. |        4 |
 5027. |        4 |
 5035. |        6 |
 5036. |        6 |
       |----------|
 5037. |        6 |
 5038. |        6 |
 5040. |        6 |
 5041. |        6 |
 5042. |        6 |
       |----------|
 5043. |        6 |
 5062. |       11 |
 5063. |       11 |
 5064. |       11 |
 5065. |       11 |
       |----------|
 5068. |       11 |
 5069. |        9 |
 5073. |        4 |
 5074. |        4 |
 5095. |        4 |
       |----------|
 5096. |        4 |
 5114. |       11 |
 5115. |       11 |
 5124. |        4 |
 5125. |       12 |
       |----------|
 5139. |       12 |
 5140. |        5 |
 5141. |        5 |
 5151. |       12 |
 5152. |       12 |
       |----------|
 5153. |       11 |
 5154. |       12 |
 5161. |       11 |
 5162. |       11 |
 5163. |       11 |
       |----------|
 5173. |        4 |
 5174. |        4 |
 5175. |        4 |
 5176. |        4 |
 5200. |        4 |
       |----------|
 5201. |        4 |
 5202. |        4 |
 5203. |        4 |
 5214. |        7 |
 5215. |       11 |
       |----------|
 5216. |       11 |
 5226. |        6 |
 5227. |        6 |
 5237. |       11 |
 5238. |       11 |
       |----------|
 5239. |       11 |
 5244. |        6 |
 5257. |        7 |
 5258. |        6 |
 5259. |        6 |
       |----------|
 5267. |       11 |
 5268. |       11 |
 5278. |       11 |
 5279. |       11 |
 5287. |        4 |
       |----------|
 5288. |       11 |
 5298. |       11 |
 5299. |       11 |
 5300. |       11 |
 5301. |       11 |
       |----------|
 5302. |       11 |
 5303. |        9 |
 5315. |        6 |
 5323. |       11 |
 5327. |       11 |
       |----------|
 5328. |       11 |
 5329. |       11 |
 5330. |       11 |
 5331. |       11 |
 5340. |       11 |
       |----------|
 5341. |       11 |
 5342. |       11 |
 5343. |       11 |
 5344. |       11 |
 5345. |       11 |
       |----------|
 5359. |       11 |
 5360. |       11 |
 5361. |       11 |
 5362. |       11 |
 5363. |       11 |
       |----------|
 5364. |       11 |
 5365. |       11 |
 5369. |        9 |
 5399. |       11 |
 5407. |       11 |
       |----------|
 5408. |       11 |
 5409. |       11 |
 5418. |        7 |
 5419. |        7 |
 5428. |        4 |
       |----------|
 5429. |        4 |
 5430. |        4 |
 5431. |        4 |
 5440. |       11 |
 5441. |       11 |
       |----------|
 5451. |       11 |
 5459. |       11 |
 5466. |       11 |
 5467. |       11 |
 5468. |       11 |
       |----------|
 5469. |       11 |
 5470. |       11 |
 5471. |       11 |
 5480. |        9 |
 5481. |        9 |
       |----------|
 5492. |       11 |
 5493. |        7 |
 5494. |        7 |
 5507. |       11 |
 5508. |       11 |
       |----------|
 5510. |        6 |
 5511. |        6 |
 5512. |        6 |
 5513. |        7 |
 5514. |        6 |
       |----------|
 5534. |       11 |
 5535. |        7 |
 5537. |        7 |
 5538. |        7 |
 5539. |        7 |
       |----------|
 5541. |        6 |
 5542. |        4 |
 5543. |        4 |
 5544. |        5 |
 5560. |       11 |
       |----------|
 5561. |       11 |
 5562. |        6 |
 5563. |        8 |
 5571. |       11 |
 5572. |       11 |
       |----------|
 5573. |       11 |
 5578. |        6 |
 5579. |        6 |
 5580. |        6 |
 5581. |        6 |
       |----------|
 5582. |        6 |
 5591. |       11 |
 5592. |       11 |
 5593. |       11 |
 5594. |       11 |
       |----------|
 5603. |       12 |
 5604. |       12 |
 5615. |       12 |
 5616. |       12 |
 5617. |       12 |
       |----------|
 5618. |       12 |
 5619. |       12 |
 5622. |       11 |
 5623. |       11 |
 5634. |       11 |
       |----------|
 5635. |       11 |
 5636. |       11 |
 5654. |        4 |
 5655. |        4 |
 5656. |        4 |
       |----------|
 5657. |        4 |
 5658. |        4 |
 5659. |        4 |
 5667. |        5 |
 5668. |        5 |
       |----------|
 5688. |       12 |
 5707. |       11 |
 5708. |       11 |
 5709. |       11 |
 5735. |       11 |
       |----------|
 5736. |       11 |
 5745. |       11 |
 5746. |       11 |
 5747. |       11 |
 5760. |       11 |
       |----------|
 5761. |       11 |
 5762. |       11 |
 5770. |        6 |
 5771. |        6 |
 5783. |        4 |
       |----------|
 5784. |        4 |
 5785. |        4 |
 5797. |        7 |
 5798. |        7 |
 5799. |        7 |
       |----------|
 5800. |        7 |
 5801. |        7 |
 5802. |        7 |
 5803. |        7 |
 5813. |       11 |
       |----------|
 5814. |        7 |
 5815. |       11 |
 5825. |        7 |
 5826. |       11 |
 5830. |        6 |
       |----------|
 5831. |        6 |
 5832. |        6 |
 5837. |        8 |
 5838. |        4 |
 5839. |        4 |
       |----------|
 5853. |        9 |
 5854. |        9 |
 5855. |        9 |
 5856. |        9 |
 5857. |        4 |
       |----------|
 5859. |       11 |
 5869. |       11 |
 5870. |       11 |
 5879. |        6 |
 5880. |        6 |
       |----------|
 5893. |       11 |
 5894. |       11 |
 5895. |       11 |
 5905. |       12 |
 5906. |       12 |
       |----------|
 5907. |       12 |
 5940. |       11 |
 5941. |       11 |
 5942. |       11 |
 5943. |       11 |
       |----------|
 5944. |       11 |
 5945. |       11 |
 5949. |        9 |
 5950. |        9 |
 5951. |        9 |
       |----------|
 5952. |        9 |
 5953. |        9 |
 5960. |        5 |
 5961. |        5 |
 5962. |        5 |
       |----------|
 5981. |       12 |
 5982. |       12 |
 5983. |       12 |
 5984. |       12 |
 5985. |       12 |
       |----------|
 6003. |        4 |
 6004. |        4 |
 6005. |        8 |
 6006. |        8 |
 6023. |        7 |
       |----------|
 6024. |        7 |
 6025. |        7 |
 6033. |       11 |
 6034. |       11 |
 6045. |       11 |
       |----------|
 6046. |       11 |
 6047. |       11 |
 6048. |       11 |
 6049. |       11 |
 6063. |       11 |
       |----------|
 6064. |       11 |
 6075. |       11 |
 6076. |       11 |
 6091. |       11 |
 6092. |       11 |
       |----------|
 6093. |       11 |
 6094. |       11 |
 6095. |       11 |
 6097. |        6 |
 6103. |        7 |
       |----------|
 6104. |        8 |
 6105. |        8 |
 6116. |        4 |
 6126. |        5 |
 6127. |       11 |
       |----------|
 6128. |       11 |
 6129. |       11 |
 6135. |       11 |
 6150. |       11 |
 6151. |       12 |
       |----------|
 6152. |       11 |
 6153. |       11 |
 6158. |       12 |
 6159. |       12 |
 6160. |       12 |
       |----------|
 6161. |       11 |
 6171. |        4 |
 6172. |        4 |
 6173. |        4 |
 6174. |        4 |
       |----------|
 6175. |        4 |
 6187. |        7 |
 6188. |        7 |
 6189. |        7 |
 6190. |        8 |
       |----------|
 6191. |        5 |
 6192. |        5 |
 6202. |       11 |
 6203. |       11 |
 6204. |       11 |
       |----------|
 6205. |       11 |
 6206. |       11 |
 6237. |        5 |
 6238. |        5 |
 6239. |        5 |
       |----------|
 6240. |        5 |
 6265. |       11 |
 6266. |       11 |
 6267. |       11 |
 6268. |       11 |
       |----------|
 6269. |       11 |
 6276. |       11 |
 6277. |       11 |
 6278. |       11 |
 6279. |       11 |
       |----------|
 6280. |       11 |
 6294. |        5 |
 6295. |        5 |
 6296. |        5 |
 6297. |        5 |
       |----------|
 6298. |        5 |
 6314. |       11 |
 6315. |       11 |
 6328. |        5 |
 6329. |        5 |
       |----------|
 6330. |        5 |
 6331. |        5 |
 6339. |        5 |
 6340. |        5 |
 6353. |       11 |
       |----------|
 6354. |       11 |
 6355. |       11 |
 6356. |        4 |
 6365. |        4 |
 6366. |        4 |
       |----------|
 6378. |        7 |
 6379. |        7 |
 6380. |        7 |
 6388. |        5 |
 6389. |        5 |
       |----------|
 6390. |        5 |
 6391. |        5 |
 6419. |        4 |
 6420. |        4 |
 6421. |        . |
       |----------|
 6422. |        4 |
 6433. |        6 |
 6434. |        6 |
 6435. |       11 |
 6436. |       11 |
       |----------|
 6437. |       11 |
 6438. |       11 |
 6439. |       11 |
 6440. |       11 |
 6441. |       11 |
       |----------|
 6442. |       11 |
 6475. |       11 |
 6476. |       11 |
 6530. |        8 |
 6531. |       11 |
       |----------|
 6545. |        7 |
 6546. |        7 |
 6547. |        7 |
 6563. |        7 |
 6564. |        7 |
       |----------|
 6570. |        5 |
 6571. |        5 |
 6604. |        7 |
 6605. |        7 |
 6606. |        7 |
       |----------|
 6607. |        7 |
 6608. |        7 |
 6609. |        7 |
 6611. |        4 |
 6612. |        4 |
       |----------|
 6645. |        6 |
 6646. |        6 |
 6647. |        6 |
 6648. |        6 |
 6649. |        6 |
       |----------|
 6650. |        6 |
 6658. |        . |
 6730. |        8 |
 6731. |        7 |
 6739. |        9 |
       |----------|
 6745. |       11 |
 6746. |       11 |
 6747. |       11 |
 6748. |       11 |
 6751. |       11 |
       |----------|
 6752. |       11 |
 6753. |       11 |
 6754. |       11 |
 6760. |       12 |
 6780. |        8 |
       |----------|
 6792. |        4 |
 6793. |        4 |
 6794. |        4 |
 6795. |        8 |
 6796. |        4 |
       |----------|
 6797. |        4 |
 6824. |       11 |
 6825. |       11 |
 6841. |       11 |
 6842. |       11 |
       |----------|
 6843. |       11 |
 6844. |       11 |
 6854. |        6 |
 6855. |        6 |
 6856. |        6 |
       |----------|
 6857. |        6 |
 6858. |        6 |
 6877. |        6 |
 6878. |        6 |
 6879. |        6 |
       |----------|
 6880. |        6 |
 6881. |        6 |
 6907. |       11 |
 6908. |       11 |
 6909. |       11 |
       |----------|
 6910. |       11 |
 6911. |       11 |
 6916. |        4 |
 6917. |        4 |
 6918. |        4 |
       |----------|
 6919. |        4 |
 6920. |        4 |
 6938. |       11 |
 6939. |       11 |
 6940. |       11 |
       |----------|
 6945. |        . |
 6946. |        4 |
 6955. |       11 |
 6956. |        9 |
 6957. |        9 |
       |----------|
 6958. |        9 |
 6959. |        9 |
 6967. |       11 |
 6968. |       11 |
 6969. |       11 |
       |----------|
 6970. |       11 |
 6973. |        4 |
 6974. |        4 |
 7007. |       11 |
 7008. |       11 |
       |----------|
 7009. |       11 |
 7010. |       11 |
 7011. |       11 |
 7012. |       11 |
 7021. |       11 |
       |----------|
 7022. |       11 |
 7023. |       11 |
 7024. |       11 |
 7061. |        5 |
 7062. |        5 |
       |----------|
 7070. |       11 |
 7071. |       11 |
 7072. |       11 |
 7073. |       11 |
 7074. |       11 |
       |----------|
 7079. |       11 |
 7084. |        7 |
 7094. |        7 |
 7095. |        7 |
 7096. |        7 |
       |----------|
 7097. |        . |
 7107. |        7 |
 7111. |       11 |
 7157. |        8 |
 7188. |        5 |
       |----------|
 7189. |        5 |
 7190. |        5 |
 7220. |        9 |
 7252. |       11 |
 7255. |        4 |
       |----------|
 7273. |        7 |
 7274. |        7 |
 7284. |        7 |
 7288. |        4 |
 7289. |        4 |
       |----------|
 7290. |        4 |
 7291. |        4 |
 7292. |        4 |
 7301. |       11 |
 7302. |       11 |
       |----------|
 7303. |       11 |
 7304. |       11 |
 7311. |        4 |
 7312. |        6 |
 7313. |        6 |
       |----------|
 7315. |        6 |
 7332. |        7 |
 7335. |        6 |
 7344. |       11 |
 7345. |       11 |
       |----------|
 7346. |       11 |
 7363. |        7 |
 7364. |        7 |
 7380. |       12 |
 7381. |       12 |
       |----------|
 7382. |       12 |
 7384. |       12 |
 7394. |        4 |
 7395. |        4 |
 7396. |        4 |
       |----------|
 7397. |        4 |
 7406. |        4 |
 7407. |        4 |
 7408. |        4 |
 7409. |        4 |
       |----------|
 7410. |        4 |
 7411. |        4 |
 7412. |        4 |
 7429. |       11 |
 7430. |        4 |
       |----------|
 7453. |        4 |
 7454. |        4 |
 7455. |       11 |
 7456. |       11 |
 7457. |       11 |
       |----------|
 7459. |       11 |
 7460. |       11 |
 7461. |       11 |
 7462. |       11 |
 7463. |       11 |
       |----------|
 7464. |       11 |
 7468. |        5 |
 7469. |        5 |
 7470. |        5 |
 7474. |        9 |
       |----------|
 7478. |       11 |
 7479. |       11 |
 7480. |       11 |
 7484. |        5 |
 7485. |        5 |
       |----------|
 7495. |       11 |
 7496. |       11 |
 7509. |        7 |
 7510. |        7 |
 7511. |       11 |
       |----------|
 7512. |       11 |
 7513. |       11 |
 7530. |       11 |
 7531. |        9 |
 7562. |        5 |
       |----------|
 7563. |        5 |
 7564. |        5 |
 7565. |        5 |
 7566. |        5 |
 7576. |        7 |
       |----------|
 7577. |        7 |
 7607. |        7 |
 7611. |       11 |
 7612. |       11 |
 7613. |       11 |
       |----------|
 7614. |       11 |
 7640. |        7 |
 7641. |       11 |
 7642. |       11 |
 7664. |       11 |
       |----------|
 7665. |       11 |
 7666. |       11 |
 7667. |       11 |
 7673. |        6 |
 7674. |        6 |
       |----------|
 7680. |       11 |
 7712. |       11 |
 7713. |       11 |
 7728. |        6 |
 7745. |       11 |
       |----------|
 7746. |       11 |
 7747. |       11 |
 7759. |        5 |
 7760. |        4 |
 7761. |       12 |
       |----------|
 7762. |       12 |
 7771. |       11 |
 7786. |        4 |
 7787. |        4 |
 7788. |        4 |
       |----------|
 7789. |        4 |
 7790. |        8 |
 7791. |        7 |
 7797. |       11 |
 7798. |       11 |
       |----------|
 7799. |       11 |
 7818. |       11 |
 7819. |       11 |
 7820. |       11 |
 7821. |       11 |
       |----------|
 7822. |       11 |
 7846. |       11 |
 7847. |       11 |
 7848. |       11 |
 7849. |       11 |
       |----------|
 7856. |        5 |
 7857. |        5 |
 7858. |        5 |
 7859. |        5 |
 7878. |        4 |
       |----------|
 7879. |        4 |
 7880. |        4 |
 7888. |       10 |
 7899. |        6 |
 7900. |        6 |
       |----------|
 7901. |        6 |
 7918. |       11 |
 7919. |       11 |
 7920. |       11 |
 7921. |       12 |
       |----------|
 7925. |        5 |
 7926. |        5 |
 7935. |        9 |
 7936. |        9 |
 7937. |        6 |
       |----------|
 7938. |        4 |
 7939. |        4 |
 7940. |        4 |
 7957. |        4 |
 7958. |        4 |
       |----------|
 7959. |        . |
 7960. |        4 |
 7974. |       11 |
 7991. |        6 |
 7992. |        6 |
       |----------|
 8000. |        7 |
 8001. |        7 |
 8002. |        7 |
 8010. |       12 |
 8011. |        6 |
       |----------|
 8034. |        6 |
 8035. |        6 |
 8036. |        6 |
 8037. |        6 |
 8038. |        6 |
       |----------|
 8047. |        4 |
 8048. |        . |
 8049. |        4 |
 8055. |       11 |
 8056. |       11 |
       |----------|
 8057. |       11 |
 8061. |        4 |
 8062. |        4 |
 8073. |        6 |
 8109. |        4 |
       |----------|
 8110. |        4 |
 8111. |        4 |
 8112. |        4 |
 8113. |        4 |
 8114. |        4 |
       |----------|
 8130. |        7 |
 8131. |        7 |
 8132. |        7 |
 8151. |       11 |
 8152. |       11 |
       |----------|
 8153. |       11 |
 8171. |       11 |
 8172. |       11 |
 8175. |        6 |
 8203. |       11 |
       |----------|
 8204. |       11 |
 8205. |       11 |
 8220. |        7 |
 8221. |        7 |
 8222. |        7 |
       |----------|
 8223. |        7 |
 8224. |        7 |
 8243. |       11 |
 8253. |        7 |
 8294. |        4 |
       |----------|
 8295. |       11 |
 8301. |        4 |
 8312. |        5 |
 8313. |        7 |
 8321. |       11 |
       |----------|
 8322. |       11 |
 8323. |       11 |
 8329. |        4 |
 8330. |        4 |
 8331. |        4 |
       |----------|
 8333. |        4 |
 8342. |        8 |
 8350. |       11 |
 8351. |       11 |
 8352. |       11 |
       |----------|
 8353. |       11 |
 8354. |       11 |
 8355. |       11 |
 8356. |       11 |
 8367. |        6 |
       |----------|
 8368. |        6 |
 8369. |        6 |
 8370. |        6 |
 8371. |        6 |
 8372. |        6 |
       |----------|
 8375. |       11 |
 8385. |        4 |
 8386. |        4 |
 8392. |        9 |
 8393. |        9 |
       |----------|
 8394. |        9 |
 8395. |        9 |
 8405. |        4 |
 8406. |        4 |
 8407. |        4 |
       |----------|
 8408. |        4 |
 8409. |        4 |
 8418. |        4 |
 8419. |        4 |
 8427. |        3 |
       |----------|
 8428. |       11 |
 8429. |        6 |
 8430. |        6 |
 8440. |       11 |
 8441. |       11 |
       |----------|
 8445. |       11 |
 8446. |       11 |
 8447. |       11 |
 8448. |       11 |
 8449. |       11 |
       |----------|
 8470. |        4 |
 8474. |        1 |
 8499. |        7 |
 8500. |        7 |
 8501. |        7 |
       |----------|
 8510. |       11 |
 8511. |       11 |
 8512. |       11 |
 8513. |       11 |
 8514. |       11 |
       |----------|
 8516. |       11 |
 8532. |       11 |
 8533. |       11 |
 8534. |       11 |
 8535. |       11 |
       |----------|
 8536. |       11 |
 8544. |        9 |
 8545. |        9 |
 8546. |        9 |
 8583. |       11 |
       |----------|
 8584. |       11 |
 8585. |        5 |
 8586. |        3 |
 8609. |       11 |
 8610. |       11 |
       |----------|
 8617. |       11 |
 8629. |        4 |
 8654. |       11 |
 8655. |       11 |
 8668. |        6 |
       |----------|
 8678. |        4 |
 8679. |        4 |
 8680. |        4 |
 8681. |        4 |
 8704. |        7 |
       |----------|
 8705. |        7 |
 8711. |        6 |
 8767. |        9 |
 8769. |       11 |
 8770. |       11 |
       |----------|
 8778. |       11 |
 8779. |       12 |
 8780. |       11 |
 8781. |       11 |
 8782. |       11 |
       |----------|
 8783. |       12 |
 8791. |       11 |
 8800. |        9 |
 8811. |       11 |
 8812. |       11 |
       |----------|
 8813. |       11 |
 8814. |       11 |
 8815. |        8 |
 8816. |        8 |
 8817. |        8 |
       |----------|
 8823. |        6 |
 8824. |       11 |
 8835. |       11 |
 8836. |       11 |
 8837. |       11 |
       |----------|
 8838. |       11 |
 8844. |        7 |
 8845. |        7 |
 8846. |        7 |
 8847. |        8 |
       |----------|
 8848. |        8 |
 8857. |       12 |
 8858. |       12 |
 8859. |       12 |
 8860. |       12 |
       |----------|
 8861. |       12 |
 8862. |       12 |
 8871. |       11 |
 8872. |       11 |
 8873. |       11 |
       |----------|
 8874. |       11 |
 8875. |       11 |
 8876. |       11 |
 8893. |       11 |
 8894. |       11 |
       |----------|
 8895. |       11 |
 8896. |       11 |
 8907. |        8 |
 8913. |        4 |
 8914. |        6 |
       |----------|
 8915. |        6 |
 8931. |       11 |
 8932. |       11 |
 8959. |       12 |
 8960. |       12 |
       |----------|
 8961. |       12 |
 8967. |        6 |
 8986. |        6 |
 8987. |        6 |
 8992. |       11 |
       |----------|
 9000. |       11 |
 9001. |       11 |
 9002. |       11 |
 9011. |       11 |
 9012. |       11 |
       |----------|
 9039. |        4 |
 9040. |        4 |
 9049. |        6 |
 9050. |        6 |
 9054. |       11 |
       |----------|
 9055. |       11 |
 9056. |       11 |
 9057. |       11 |
 9058. |       11 |
 9059. |       11 |
       |----------|
 9097. |        6 |
 9098. |        6 |
 9099. |        6 |
 9113. |       11 |
 9114. |       11 |
       |----------|
 9124. |        3 |
 9134. |        7 |
 9135. |        7 |
 9136. |        7 |
 9143. |        4 |
       |----------|
 9144. |        4 |
 9145. |        4 |
 9155. |       11 |
 9156. |       11 |
 9157. |       11 |
       |----------|
 9184. |        7 |
 9186. |       11 |
 9187. |       11 |
 9205. |       11 |
 9206. |       11 |
       |----------|
 9207. |       11 |
 9208. |       11 |
 9209. |       11 |
 9220. |       11 |
 9221. |       11 |
       |----------|
 9222. |        6 |
 9223. |        6 |
 9224. |        6 |
 9236. |       11 |
 9237. |       11 |
       |----------|
 9247. |        7 |
 9248. |        7 |
 9249. |        7 |
 9250. |        7 |
 9251. |        7 |
       |----------|
 9252. |        7 |
 9271. |       11 |
 9272. |       11 |
 9295. |       11 |
 9318. |        7 |
       |----------|
 9319. |        7 |
 9320. |        7 |
 9321. |        7 |
 9329. |       12 |
 9330. |       12 |
       |----------|
 9331. |       11 |
 9332. |       11 |
 9349. |       12 |
 9350. |       12 |
 9351. |       12 |
       |----------|
 9352. |       11 |
 9353. |       11 |
 9363. |        8 |
 9364. |        8 |
 9365. |        4 |
       |----------|
 9366. |        4 |
 9367. |        4 |
 9384. |        6 |
 9385. |        6 |
 9386. |        6 |
       |----------|
 9387. |        6 |
 9388. |        6 |
 9401. |       11 |
 9402. |       11 |
 9403. |       11 |
       |----------|
 9404. |       11 |
 9405. |       11 |
 9406. |       11 |
 9407. |       11 |
 9432. |        6 |
       |----------|
 9433. |        6 |
 9440. |       12 |
 9441. |       12 |
 9450. |        6 |
 9455. |       10 |
       |----------|
 9464. |        5 |
 9474. |       12 |
 9475. |       12 |
 9489. |       11 |
 9490. |       11 |
       |----------|
 9493. |       11 |
 9494. |       11 |
 9495. |       11 |
 9504. |       11 |
 9505. |       11 |
       |----------|
 9506. |       11 |
 9507. |        8 |
 9508. |        8 |
 9521. |        4 |
 9522. |        4 |
       |----------|
 9529. |        4 |
 9530. |        4 |
 9538. |        4 |
 9539. |        4 |
 9540. |        4 |
       |----------|
 9541. |        4 |
 9550. |        4 |
 9551. |        4 |
 9576. |        7 |
 9577. |       12 |
       |----------|
 9578. |       12 |
 9579. |       11 |
 9580. |       12 |
 9590. |        4 |
 9591. |        4 |
       |----------|
 9592. |        4 |
 9593. |        4 |
 9594. |        4 |
 9603. |        4 |
 9604. |        4 |
       |----------|
 9605. |        4 |
 9606. |        4 |
 9607. |        4 |
 9608. |        4 |
 9615. |        6 |
       |----------|
 9616. |        6 |
 9617. |        6 |
 9626. |        4 |
 9627. |        4 |
 9628. |        4 |
       |----------|
 9629. |        4 |
 9630. |        4 |
 9631. |        4 |
 9632. |        . |
 9646. |        4 |
       |----------|
 9647. |        4 |
 9648. |        4 |
 9649. |        4 |
 9659. |        4 |
 9660. |        4 |
       |----------|
 9661. |        4 |
 9662. |        4 |
 9663. |        4 |
 9697. |        6 |
 9744. |       11 |
       |----------|
 9745. |       11 |
 9746. |       11 |
 9747. |       11 |
 9748. |       11 |
 9755. |       11 |
       |----------|
 9756. |       11 |
 9757. |       11 |
 9758. |       11 |
 9759. |       11 |
 9760. |       11 |
       |----------|
 9770. |        6 |
 9777. |       11 |
 9778. |       11 |
 9779. |       11 |
 9780. |       11 |
       |----------|
 9791. |       12 |
 9792. |       12 |
 9793. |       11 |
 9794. |       11 |
 9795. |       11 |
       |----------|
 9806. |       11 |
 9807. |       11 |
 9808. |       11 |
 9834. |        4 |
 9835. |        4 |
       |----------|
 9847. |        4 |
 9848. |        4 |
 9857. |        4 |
 9858. |        4 |
 9859. |        4 |
       |----------|
 9860. |        4 |
 9861. |        4 |
 9870. |       11 |
 9874. |        6 |
 9875. |        6 |
       |----------|
 9876. |        6 |
 9890. |       12 |
 9891. |       12 |
 9892. |       12 |
 9893. |       12 |
       |----------|
 9894. |       12 |
 9895. |       12 |
 9896. |       12 |
 9904. |       11 |
 9905. |       11 |
       |----------|
 9933. |        7 |
 9934. |        7 |
 9941. |       11 |
 9950. |        4 |
 9951. |        4 |
       |----------|
 9952. |        4 |
 9953. |        4 |
 9957. |       11 |
 9958. |       11 |
 9959. |       11 |
       |----------|
 9960. |       11 |
 9961. |       11 |
 9980. |        6 |
 9981. |        6 |
 9982. |        7 |
       |----------|
 9983. |        7 |
 9984. |        7 |
10012. |       11 |
10013. |       11 |
10021. |        4 |
       |----------|
10022. |        4 |
10023. |        4 |
10024. |        4 |
10025. |        4 |
10030. |       11 |
       |----------|
10031. |       11 |
10061. |       11 |
10062. |       11 |
10063. |       11 |
10064. |       11 |
       |----------|
10065. |       11 |
10066. |       11 |
10074. |       11 |
10115. |        6 |
10116. |        7 |
       |----------|
10117. |        7 |
10118. |        7 |
10122. |        4 |
10123. |        4 |
10124. |        6 |
       |----------|
10125. |        6 |
10145. |        5 |
10146. |        5 |
10147. |        5 |
10148. |        5 |
       |----------|
10149. |        5 |
10156. |       12 |
10157. |       12 |
10158. |       12 |
10159. |       12 |
       |----------|
10160. |       11 |
10167. |       11 |
10168. |       11 |
10169. |       11 |
10170. |       11 |
       |----------|
10177. |       11 |
10178. |       11 |
10179. |       11 |
10180. |       11 |
10181. |       11 |
       |----------|
10191. |        6 |
10192. |        6 |
10193. |        6 |
10194. |        6 |
10195. |        6 |
       |----------|
10196. |        6 |
10222. |        9 |
10223. |        9 |
10224. |        9 |
10225. |        6 |
       |----------|
10226. |        6 |
10227. |        6 |
10249. |       11 |
10250. |       11 |
10251. |       11 |
       |----------|
10256. |        6 |
10257. |        6 |
10261. |       11 |
10281. |        4 |
10282. |        4 |
       |----------|
10283. |        4 |
10284. |        4 |
10285. |        4 |
10286. |        4 |
10297. |       12 |
       |----------|
10298. |       11 |
10299. |        4 |
10300. |        4 |
10304. |        4 |
10305. |        4 |
       |----------|
10316. |       11 |
10317. |       11 |
10341. |        6 |
10342. |        4 |
10343. |        4 |
       |----------|
10352. |        4 |
10353. |        4 |
10354. |        5 |
10355. |        6 |
10356. |        5 |
       |----------|
10357. |        6 |
10365. |        6 |
10374. |        4 |
10375. |        4 |
10384. |       12 |
       |----------|
10385. |       12 |
10386. |       12 |
10387. |       12 |
10388. |       12 |
10389. |        5 |
       |----------|
10390. |        5 |
10391. |        5 |
10394. |        4 |
10395. |        6 |
10396. |        7 |
       |----------|
10405. |       11 |
10406. |       11 |
10407. |       11 |
10411. |       11 |
10432. |       11 |
       |----------|
10433. |       11 |
10441. |       11 |
10442. |       11 |
10443. |       11 |
10444. |       11 |
       |----------|
10445. |       11 |
10451. |       11 |
10457. |       11 |
10458. |       11 |
10459. |       11 |
       |----------|
10466. |        5 |
10468. |        6 |
10469. |        6 |
10477. |        5 |
10478. |        . |
       |----------|
10479. |        5 |
10480. |        5 |
10481. |        5 |
10482. |        5 |
10483. |        5 |
       |----------|
10484. |        5 |
10485. |        5 |
10486. |        5 |
10487. |        5 |
10494. |       11 |
       |----------|
10519. |       12 |
10520. |       12 |
10521. |       12 |
10530. |       11 |
10537. |       11 |
       |----------|
10538. |        8 |
10539. |       11 |
10540. |       11 |
10541. |       11 |
10542. |       11 |
       |----------|
10547. |       11 |
10548. |       11 |
10549. |       11 |
10550. |       11 |
10555. |       12 |
       |----------|
10556. |       11 |
10566. |        6 |
10567. |        6 |
10568. |        6 |
10578. |        4 |
       |----------|
10594. |        9 |
10605. |        8 |
10606. |       11 |
10620. |       12 |
10621. |       12 |
       |----------|
10626. |        9 |
10641. |       11 |
10647. |        7 |
10648. |        8 |
10668. |        4 |
       |----------|
10683. |       11 |
10687. |       11 |
10688. |       11 |
10689. |        9 |
10700. |        3 |
       |----------|
10701. |        3 |
10702. |        3 |
10703. |        3 |
10704. |        4 |
10711. |        7 |
       |----------|
10712. |        7 |
10713. |        7 |
10714. |        7 |
10715. |        7 |
10716. |        7 |
       |----------|
10722. |       12 |
10723. |        3 |
10730. |       11 |
10731. |       11 |
10769. |       11 |
       |----------|
10784. |        5 |
10785. |        5 |
10795. |       11 |
10796. |       11 |
10797. |       11 |
       |----------|
10798. |       11 |
10799. |       11 |
10804. |       11 |
10805. |       11 |
10806. |       11 |
       |----------|
10807. |       11 |
10808. |       11 |
10816. |        7 |
10817. |        7 |
10818. |        7 |
       |----------|
10819. |        4 |
10820. |        5 |
10837. |        9 |
10839. |        4 |
10840. |        4 |
       |----------|
10847. |        6 |
10848. |        6 |
10849. |        6 |
10860. |        6 |
10871. |        7 |
       |----------|
10872. |        7 |
10874. |       11 |
10875. |       11 |
10882. |        6 |
10883. |        6 |
       |----------|
10884. |        6 |
10893. |        3 |
10894. |        3 |
10895. |        3 |
10896. |        3 |
       |----------|
10897. |        3 |
10898. |        3 |
10899. |        3 |
10900. |       11 |
10901. |       11 |
       |----------|
10902. |       11 |
10903. |       11 |
10913. |        4 |
10914. |        4 |
10933. |        4 |
       |----------|
10934. |        4 |
10935. |        4 |
10936. |        4 |
10937. |        4 |
10938. |        4 |
       |----------|
10959. |       11 |
10960. |       11 |
10961. |        4 |
10962. |        4 |
10963. |        4 |
       |----------|
10964. |        4 |
10965. |        4 |
10966. |        4 |
10972. |       12 |
10973. |       12 |
       |----------|
10979. |       11 |
10980. |       11 |
10981. |       11 |
11004. |       12 |
11005. |       12 |
       |----------|
11006. |       12 |
11007. |        7 |
11008. |        7 |
11020. |       11 |
11022. |       11 |
       |----------|
11023. |       11 |
11044. |        6 |
11045. |        4 |
11061. |        6 |
11062. |        6 |
       |----------|
11063. |        6 |
11069. |       11 |
11070. |       11 |
11078. |       11 |
11079. |       11 |
       |----------|
11080. |       11 |
11097. |        5 |
11117. |        4 |
11118. |        4 |
11119. |        4 |
       |----------|
11120. |        4 |
11121. |        4 |
11122. |        4 |
11132. |        4 |
11133. |        4 |
       |----------|
11134. |        4 |
11135. |        6 |
11136. |        4 |
11137. |        4 |
11140. |       11 |
       |----------|
11141. |       11 |
11142. |       11 |
11144. |        7 |
11145. |       11 |
11146. |        4 |
       |----------|
11147. |        4 |
11154. |       11 |
11155. |       11 |
11156. |       11 |
11157. |       11 |
       |----------|
11158. |       11 |
11159. |       11 |
11170. |       11 |
11171. |       11 |
11172. |       11 |
       |----------|
11175. |        4 |
11182. |       11 |
11183. |       11 |
11184. |       11 |
11185. |       11 |
       |----------|
11196. |       11 |
11197. |       11 |
11198. |       11 |
11199. |       11 |
11207. |        7 |
       |----------|
11208. |        7 |
11209. |        7 |
11218. |       11 |
11219. |       11 |
11220. |       11 |
       |----------|
11227. |        7 |
11235. |        7 |
11250. |        4 |
11260. |        6 |
11261. |        6 |
       |----------|
11262. |        6 |
11263. |        6 |
11269. |       11 |
11270. |       11 |
11289. |        7 |
       |----------|
11305. |       11 |
11307. |       11 |
11316. |       11 |
11323. |       11 |
11330. |        6 |
       |----------|
11331. |        6 |
11332. |        6 |
11340. |        9 |
11341. |        9 |
11345. |       11 |
       |----------|
11346. |       11 |
11347. |        9 |
11348. |        9 |
11349. |       11 |
11350. |       11 |
       |----------|
11362. |        9 |
11375. |       11 |
11376. |       11 |
11377. |       11 |
11378. |       11 |
       |----------|
11379. |       11 |
11397. |        7 |
11398. |        7 |
11399. |        7 |
11400. |        7 |
       |----------|
11401. |        7 |
11407. |       11 |
11413. |       11 |
11414. |        8 |
11415. |       11 |
       |----------|
11416. |       11 |
11428. |       11 |
11429. |       11 |
11472. |        4 |
11473. |        4 |
       |----------|
11477. |        4 |
11478. |        4 |
11479. |        4 |
11480. |        4 |
11481. |        4 |
       |----------|
11502. |       11 |
11503. |       11 |
11504. |       11 |
11505. |       11 |
11513. |        7 |
       |----------|
11514. |        7 |
11515. |        7 |
11516. |        7 |
11517. |        7 |
11529. |       11 |
       |----------|
11530. |       11 |
11531. |       11 |
11532. |        8 |
11538. |        4 |
11539. |        4 |
       |----------|
11547. |        4 |
11548. |        4 |
11564. |       11 |
11565. |       11 |
11569. |       11 |
       |----------|
11570. |       11 |
11571. |       11 |
11572. |       11 |
11573. |       11 |
11583. |        7 |
       |----------|
11584. |        7 |
11585. |        7 |
11586. |        5 |
11587. |        5 |
11600. |        4 |
       |----------|
11601. |        4 |
11602. |        4 |
11603. |        4 |
11604. |        4 |
11614. |       11 |
       |----------|
11615. |       11 |
11616. |       11 |
11617. |       11 |
11618. |       11 |
11620. |       11 |
       |----------|
11621. |       11 |
11622. |       11 |
11623. |       11 |
11626. |        3 |
11627. |        4 |
       |----------|
11628. |        4 |
11629. |        4 |
11648. |        6 |
11649. |        6 |
11650. |        6 |
       |----------|
11651. |        6 |
11652. |        6 |
11653. |       12 |
11654. |        8 |
11655. |        8 |
       |----------|
11685. |       11 |
11686. |       11 |
11687. |       11 |
11688. |       11 |
11689. |       11 |
       |----------|
11690. |       11 |
11703. |        4 |
11704. |       11 |
11705. |       11 |
11706. |        4 |
       |----------|
11709. |       11 |
11710. |       11 |
11711. |       11 |
11739. |        4 |
11744. |        5 |
       |----------|
11745. |        5 |
11746. |       11 |
11783. |        4 |
11784. |        4 |
11785. |        4 |
       |----------|
11786. |        4 |
11787. |        4 |
11791. |        6 |
11797. |       11 |
11798. |        4 |
       |----------|
11799. |        4 |
11817. |       11 |
11818. |       11 |
11820. |       11 |
11821. |       11 |
       |----------|
11822. |       11 |
11830. |        1 |
11831. |        3 |
11832. |        8 |
11833. |        7 |
       |----------|
11835. |        6 |
11836. |        4 |
11837. |        4 |
11838. |        4 |
11839. |        4 |
       |----------|
11857. |        4 |
11858. |        4 |
11859. |        4 |
11863. |       11 |
11864. |       11 |
       |----------|
11865. |        . |
11870. |       11 |
11871. |       11 |
11872. |       11 |
11888. |        4 |
       |----------|
11896. |        4 |
11897. |        4 |
11906. |        8 |
11907. |       11 |
11908. |       11 |
       |----------|
11941. |       12 |
11942. |       12 |
11943. |       12 |
11944. |       12 |
11945. |       12 |
       |----------|
11946. |       12 |
11950. |        5 |
11951. |        5 |
11952. |        5 |
11963. |       11 |
       |----------|
11964. |       11 |
11965. |        . |
11966. |       11 |
11977. |        9 |
11978. |        9 |
       |----------|
11979. |       12 |
11980. |        4 |
11981. |        4 |
11997. |        4 |
11998. |        4 |
       |----------|
12005. |       11 |
12006. |       11 |
12007. |       11 |
12008. |       11 |
12009. |       11 |
       |----------|
12010. |       11 |
12011. |       11 |
12016. |        3 |
12033. |       11 |
12034. |       12 |
       |----------|
12035. |       11 |
12055. |       11 |
12056. |       11 |
12057. |       11 |
12058. |       11 |
       |----------|
12059. |       11 |
12064. |       11 |
12065. |        8 |
12075. |        4 |
12076. |        4 |
       |----------|
12077. |        4 |
12078. |        4 |
12110. |       12 |
12111. |       12 |
12139. |        4 |
       |----------|
12140. |        4 |
12141. |        4 |
12142. |        4 |
12143. |        4 |
12144. |        4 |
       |----------|
12148. |        4 |
12149. |        4 |
12150. |        6 |
12171. |       11 |
12172. |       11 |
       |----------|
12178. |       11 |
12179. |       11 |
12180. |       11 |
12181. |       11 |
12182. |       11 |
       |----------|
12191. |        6 |
12192. |        6 |
12193. |        6 |
12201. |        4 |
12202. |        4 |
       |----------|
12203. |        4 |
12204. |        4 |
12205. |        4 |
12206. |        4 |
12207. |        4 |
       |----------|
12208. |        4 |
12209. |        4 |
12210. |        4 |
12211. |        4 |
12218. |       12 |
       |----------|
12219. |       12 |
12227. |        6 |
12228. |        6 |
12229. |       12 |
12230. |       12 |
       |----------|
12239. |       11 |
12261. |        4 |
12269. |        4 |
12270. |        4 |
12271. |        4 |
       |----------|
12272. |        4 |
12290. |        7 |
12291. |        7 |
12292. |        7 |
12293. |        7 |
       |----------|
12294. |        7 |
12300. |       11 |
12301. |       11 |
12305. |        6 |
12306. |        . |
       |----------|
12308. |        6 |
12309. |        6 |
12319. |       11 |
12326. |       11 |
12327. |       11 |
       |----------|
12328. |       11 |
12331. |       11 |
12332. |       11 |
12333. |       11 |
12342. |        7 |
       |----------|
12343. |        7 |
12353. |       11 |
12381. |       12 |
12382. |       12 |
12383. |       12 |
       |----------|
12392. |        9 |
12401. |       11 |
12402. |       11 |
12411. |       11 |
12412. |       11 |
       |----------|
12413. |       11 |
12426. |       11 |
12427. |        7 |
12428. |        3 |
12429. |        3 |
       |----------|
12458. |        4 |
12459. |        4 |
12472. |        6 |
12473. |        6 |
12482. |        4 |
       |----------|
12483. |        4 |
12484. |        4 |
12485. |        4 |
12486. |        4 |
12487. |        4 |
       |----------|
12497. |       11 |
12498. |       11 |
12499. |       11 |
12500. |       11 |
12501. |       11 |
       |----------|
12502. |       11 |
12507. |       11 |
12540. |        7 |
12541. |        7 |
12542. |        7 |
       |----------|
12551. |       11 |
12552. |       11 |
12553. |       11 |
12555. |       11 |
12556. |       12 |
       |----------|
12557. |       12 |
12558. |       12 |
12559. |       12 |
12560. |       12 |
12583. |        3 |
       |----------|
12584. |       11 |
12585. |       11 |
12586. |       11 |
12627. |       11 |
12628. |       11 |
       |----------|
12629. |       11 |
12644. |       11 |
12658. |       11 |
12668. |       11 |
12669. |       11 |
       |----------|
12670. |       11 |
12671. |       11 |
12676. |       12 |
12677. |       12 |
12692. |       11 |
       |----------|
12693. |       11 |
12694. |       11 |
12695. |       11 |
12701. |        5 |
12702. |       11 |
       |----------|
12711. |        4 |
12712. |        2 |
12713. |        2 |
12725. |        6 |
12726. |        6 |
       |----------|
12727. |        6 |
12735. |        4 |
12756. |       12 |
12757. |       12 |
12758. |       12 |
       |----------|
12759. |       12 |
12761. |        6 |
12762. |        4 |
12773. |        4 |
12774. |        4 |
       |----------|
12785. |        7 |
12804. |        5 |
12805. |        5 |
12811. |        4 |
12812. |        5 |
       |----------|
12813. |       10 |
12816. |        5 |
12817. |       11 |
12830. |       11 |
12831. |       11 |
       |----------|
12832. |       11 |
12833. |       11 |
12834. |       11 |
12845. |        5 |
12846. |       12 |
       |----------|
12875. |       11 |
12876. |       11 |
12886. |        7 |
12887. |        7 |
12888. |        6 |
       |----------|
12909. |        7 |
12910. |        7 |
12918. |        4 |
12919. |        6 |
12927. |       11 |
       |----------|
12930. |       11 |
12934. |       12 |
12935. |       12 |
12954. |       11 |
12960. |        6 |
       |----------|
12961. |        6 |
12962. |        6 |
12963. |        6 |
12972. |        9 |
12973. |        9 |
       |----------|
12974. |        4 |
12975. |        9 |
12976. |        9 |
12977. |        9 |
12992. |       11 |
       |----------|
12993. |       11 |
12994. |       11 |
12995. |       11 |
13005. |        6 |
13006. |        6 |
       |----------|
13007. |        6 |
13008. |        6 |
13009. |        6 |
13015. |       11 |
13016. |       11 |
       |----------|
13027. |       11 |
13028. |       11 |
13036. |       11 |
13037. |       11 |
13048. |       11 |
       |----------|
13049. |       11 |
13061. |       11 |
13063. |        7 |
13064. |        7 |
13071. |        7 |
       |----------|
13072. |        7 |
13073. |        7 |
13083. |       11 |
13084. |       11 |
13085. |        8 |
       |----------|
13086. |        8 |
13090. |       11 |
13091. |       11 |
13092. |       11 |
13093. |       11 |
       |----------|
13094. |        5 |
13095. |        5 |
13096. |        5 |
13097. |        5 |
13098. |        8 |
       |----------|
13108. |        8 |
13123. |        4 |
13124. |        8 |
13125. |        5 |
13126. |        4 |
       |----------|
13127. |        4 |
13137. |        4 |
13138. |        4 |
13139. |        4 |
13140. |        8 |
       |----------|
13156. |       11 |
13185. |        6 |
13199. |       11 |
13200. |       11 |
13201. |       11 |
       |----------|
13209. |        6 |
13210. |        6 |
13211. |        9 |
13212. |        9 |
13213. |        6 |
       |----------|
13225. |        7 |
13226. |        7 |
13227. |        7 |
13228. |        7 |
13236. |        5 |
       |----------|
13237. |        5 |
13238. |        5 |
13248. |        7 |
13249. |        7 |
13250. |        7 |
       |----------|
13251. |        7 |
13252. |        7 |
13253. |        7 |
13260. |        7 |
13261. |        7 |
       |----------|
13262. |        7 |
13276. |       12 |
13277. |       12 |
13278. |       12 |
13288. |       11 |
       |----------|
13289. |       11 |
13295. |       11 |
13296. |       11 |
13297. |       11 |
13298. |       11 |
       |----------|
13303. |       11 |
13304. |       11 |
13305. |       11 |
13310. |        7 |
13311. |        7 |
       |----------|
13332. |       11 |
13333. |       11 |
13334. |       11 |
13346. |       11 |
13347. |       11 |
       |----------|
13364. |       11 |
13365. |       11 |
13366. |       12 |
13367. |       11 |
13381. |        7 |
       |----------|
13435. |        4 |
13436. |        4 |
13443. |        5 |
13444. |        5 |
13445. |        5 |
       |----------|
13446. |        5 |
13453. |       11 |
13475. |        6 |
13476. |        6 |
13477. |        6 |
       |----------|
13478. |        6 |
13479. |        5 |
13480. |        5 |
13489. |        6 |
13490. |        6 |
       |----------|
13491. |        8 |
13503. |        6 |
13504. |        6 |
13505. |        7 |
13506. |        7 |
       |----------|
13516. |       12 |
13517. |       12 |
13518. |       12 |
13538. |        2 |
13539. |        6 |
       |----------|
13540. |        7 |
13541. |        7 |
13544. |       11 |
13545. |       11 |
13546. |       11 |
       |----------|
13547. |       11 |
13548. |       11 |
13549. |       11 |
13558. |       10 |
13559. |       10 |
       |----------|
13560. |       10 |
13561. |       10 |
13562. |       10 |
13563. |       10 |
13598. |       12 |
       |----------|
13599. |       12 |
13600. |       12 |
13601. |       12 |
13602. |       12 |
13603. |       12 |
       |----------|
13611. |       11 |
13612. |       11 |
13613. |       11 |
13614. |       11 |
13630. |       11 |
       |----------|
13631. |       11 |
13632. |       11 |
13633. |       11 |
13634. |       11 |
13677. |        7 |
       |----------|
13678. |       11 |
13692. |        7 |
13693. |        7 |
13694. |        7 |
13695. |        7 |
       |----------|
13696. |        7 |
13697. |        7 |
13701. |        3 |
13702. |        3 |
13717. |        5 |
       |----------|
13718. |        5 |
13719. |        5 |
13720. |        5 |
13721. |        5 |
13727. |        5 |
       |----------|
13756. |        5 |
13757. |        2 |
13758. |        5 |
13780. |        4 |
13781. |        7 |
       |----------|
13782. |        7 |
13783. |        6 |
13784. |        6 |
13793. |        7 |
13804. |       11 |
       |----------|
13816. |       11 |
13817. |        6 |
13818. |        6 |
13823. |        . |
13824. |        7 |
       |----------|
13836. |        . |
13837. |        4 |
13838. |        7 |
13839. |        2 |
13841. |       11 |
       |----------|
13842. |       11 |
13843. |       11 |
13844. |       11 |
13847. |       11 |
13848. |       11 |
       |----------|
13849. |        8 |
13856. |        6 |
13857. |        6 |
13872. |        3 |
13878. |        7 |
       |----------|
13879. |        7 |
13897. |        8 |
13905. |       12 |
13906. |       12 |
13907. |       12 |
       |----------|
13913. |        7 |
13914. |        7 |
13915. |        7 |
13916. |        7 |
13917. |        7 |
       |----------|
13923. |       11 |
13924. |       11 |
13925. |       11 |
13935. |       11 |
13937. |       11 |
       |----------|
13950. |        4 |
13951. |        4 |
13952. |        4 |
13953. |        4 |
13954. |        4 |
       |----------|
13957. |        1 |
13958. |        1 |
13959. |        1 |
13960. |        1 |
13961. |        1 |
       |----------|
13962. |        1 |
13972. |       11 |
13973. |       11 |
13980. |        7 |
13981. |        7 |
       |----------|
13982. |        7 |
14001. |       12 |
14002. |       12 |
14003. |       12 |
14004. |       12 |
       |----------|
14006. |       11 |
14012. |        4 |
14013. |        4 |
14014. |        4 |
14015. |        4 |
       |----------|
14024. |       11 |
14025. |       11 |
14026. |       11 |
14034. |        6 |
14035. |       11 |
       |----------|
14056. |        5 |
14057. |        5 |
14058. |        5 |
14059. |        5 |
14060. |        5 |
       |----------|
14068. |       11 |
14069. |       11 |
14070. |       12 |
14071. |       12 |
14089. |        3 |
       |----------|
14090. |        6 |
14091. |        6 |
14092. |        6 |
14093. |        6 |
14094. |        6 |
       |----------|
14106. |       11 |
14128. |        6 |
14138. |       12 |
14139. |       12 |
14171. |       12 |
       |----------|
14172. |       12 |
14199. |        6 |
14200. |        6 |
14201. |        6 |
14202. |        6 |
       |----------|
14203. |        6 |
14213. |        6 |
14229. |       11 |
14230. |       11 |
14231. |       11 |
       |----------|
14232. |       11 |
14233. |       11 |
14234. |       11 |
14235. |       11 |
14236. |       11 |
       |----------|
14237. |       11 |
14243. |        7 |
14244. |        7 |
14245. |        7 |
14258. |        3 |
       |----------|
14266. |        9 |
14274. |       12 |
14284. |       11 |
14285. |       11 |
14287. |       11 |
       |----------|
14288. |       11 |
14289. |       11 |
14297. |       11 |
14298. |       11 |
14299. |       11 |
       |----------|
14303. |       11 |
14310. |       11 |
14318. |        3 |
14319. |        3 |
14320. |        7 |
       |----------|
14349. |        9 |
14350. |        9 |
14366. |       11 |
14367. |       11 |
14377. |       12 |
       |----------|
14378. |       12 |
14388. |       12 |
14389. |       12 |
14390. |       12 |
14417. |       12 |
       |----------|
14435. |        6 |
14436. |        6 |
14452. |       11 |
14453. |       11 |
14455. |       11 |
       |----------|
14456. |       11 |
14457. |       12 |
14458. |       12 |
14462. |       12 |
14463. |       12 |
       |----------|
14468. |       12 |
14469. |       12 |
14470. |       12 |
14480. |       11 |
14481. |       11 |
       |----------|
14516. |        4 |
14517. |        4 |
14544. |        4 |
14545. |        4 |
14546. |        4 |
       |----------|
14562. |       11 |
14563. |       11 |
14564. |       11 |
14579. |       11 |
14580. |       11 |
       |----------|
14581. |       11 |
14582. |       11 |
14585. |       11 |
14586. |       11 |
14587. |       11 |
       |----------|
14588. |        5 |
14589. |        5 |
14590. |        5 |
14601. |        6 |
14602. |        6 |
       |----------|
14603. |        6 |
14604. |        6 |
14611. |       12 |
14612. |       12 |
14613. |       12 |
       |----------|
14614. |       12 |
14615. |       12 |
14625. |       11 |
14626. |       11 |
14647. |        7 |
       |----------|
14648. |        7 |
14649. |        7 |
14650. |        7 |
14651. |        7 |
14662. |       11 |
       |----------|
14663. |       11 |
14664. |       11 |
14665. |       11 |
14675. |       12 |
14676. |       12 |
       |----------|
14677. |       12 |
14678. |       12 |
14699. |       11 |
14700. |       11 |
14701. |       11 |
       |----------|
14713. |       11 |
14714. |       11 |
14731. |        2 |
14732. |        2 |
14733. |        2 |
       |----------|
14734. |        4 |
14735. |        4 |
14743. |        6 |
14744. |       11 |
14745. |       11 |
       |----------|
14757. |       12 |
14758. |       12 |
14759. |       12 |
14766. |       12 |
14767. |       12 |
       |----------|
14768. |       12 |
14769. |       12 |
14770. |       12 |
14772. |       12 |
14773. |       12 |
       |----------|
14774. |       12 |
14775. |       12 |
14776. |       12 |
14783. |       11 |
14793. |        4 |
       |----------|
14794. |        4 |
14806. |        7 |
14807. |        7 |
14808. |        7 |
14809. |        7 |
       |----------|
14810. |        7 |
14811. |       12 |
14818. |       12 |
14819. |       12 |
14820. |       12 |
       |----------|
14830. |       11 |
14831. |       11 |
14832. |       11 |
14833. |       11 |
14834. |       11 |
       |----------|
14835. |       11 |
14842. |       11 |
14852. |        4 |
14853. |        4 |
14854. |        4 |
       |----------|
14864. |        5 |
14865. |        5 |
14866. |        5 |
14867. |        5 |
14868. |        5 |
       |----------|
14869. |       11 |
14870. |       11 |
14871. |       11 |
14872. |       11 |
14873. |       11 |
       |----------|
14882. |       12 |
14883. |       12 |
14917. |        7 |
14922. |       11 |
14923. |       11 |
       |----------|
14924. |        3 |
14925. |        3 |
14931. |        8 |
14932. |        8 |
14937. |        2 |
       |----------|
14938. |        2 |
14939. |        2 |
14947. |       11 |
14948. |       11 |
14949. |       11 |
       |----------|
14951. |       11 |
14955. |        4 |
14956. |        4 |
14957. |        8 |
14971. |        7 |
       |----------|
14972. |        7 |
14973. |        7 |
14974. |        7 |
14983. |       12 |
14984. |       12 |
       |----------|
14985. |       12 |
14986. |       12 |
15011. |       11 |
15012. |       11 |
15013. |       11 |
       |----------|
15014. |        . |
15015. |       12 |
15034. |       11 |
15035. |       11 |
15036. |       11 |
       |----------|
15052. |        6 |
15053. |        6 |
15054. |        6 |
15055. |        6 |
15060. |       11 |
       |----------|
15061. |       11 |
15062. |       11 |
15082. |       12 |
15083. |       12 |
15109. |        6 |
       |----------|
15119. |        4 |
15120. |        4 |
15121. |        4 |
15130. |        9 |
15158. |        4 |
       |----------|
15159. |        4 |
15160. |        6 |
15161. |        6 |
15178. |        4 |
15179. |        4 |
       |----------|
15180. |        4 |
15201. |        4 |
15202. |        4 |
15209. |        4 |
15210. |        4 |
       |----------|
15211. |        4 |
15212. |        4 |
15213. |        4 |
15232. |        5 |
15233. |        5 |
       |----------|
15234. |        5 |
15235. |        5 |
15236. |        5 |
15237. |        5 |
15249. |        3 |
       |----------|
15250. |        3 |
15251. |        3 |
15260. |       12 |
15261. |       12 |
15262. |       12 |
       |----------|
15278. |        7 |
15279. |        7 |
15280. |        . |
15281. |        4 |
15282. |        4 |
       |----------|
15283. |        4 |
15297. |       11 |
15298. |       11 |
15331. |        6 |
15332. |        4 |
       |----------|
15333. |        6 |
15337. |       11 |
15338. |       11 |
15347. |       12 |
15348. |       12 |
       |----------|
15349. |       12 |
15350. |       12 |
15351. |       12 |
15352. |       12 |
15353. |       12 |
       |----------|
15359. |       11 |
15360. |        3 |
15361. |        3 |
15362. |        3 |
15363. |        3 |
       |----------|
15370. |       11 |
15371. |       11 |
15372. |       11 |
15373. |       11 |
15379. |        9 |
       |----------|
15380. |        9 |
15381. |        9 |
15382. |        9 |
15383. |        9 |
15389. |       12 |
       |----------|
15390. |       12 |
15391. |       12 |
15412. |        6 |
15413. |        6 |
15434. |       11 |
       |----------|
15435. |       11 |
15436. |       11 |
15437. |       11 |
15438. |       11 |
15458. |       11 |
       |----------|
15459. |       11 |
15460. |       11 |
15469. |       11 |
15470. |       11 |
15471. |       11 |
       |----------|
15472. |       11 |
15473. |       11 |
15475. |       12 |
15476. |       12 |
15484. |        7 |
       |----------|
15485. |        7 |
15486. |        7 |
15487. |        7 |
15498. |        9 |
15499. |        9 |
       |----------|
15500. |        9 |
15501. |        6 |
15514. |        4 |
15530. |        9 |
15536. |       11 |
       |----------|
15537. |       11 |
15538. |       11 |
15539. |       11 |
15549. |        6 |
15550. |        6 |
       |----------|
15560. |       12 |
15561. |       11 |
15562. |       11 |
15563. |       11 |
15564. |       10 |
       |----------|
15565. |       11 |
15566. |       11 |
15567. |       11 |
15568. |       11 |
15569. |       11 |
       |----------|
15570. |       11 |
15574. |       11 |
15575. |       11 |
15576. |       11 |
15577. |       11 |
       |----------|
15580. |       11 |
15581. |       11 |
15582. |       11 |
15590. |       11 |
15591. |       11 |
       |----------|
15592. |       11 |
15593. |       11 |
15594. |       11 |
15603. |       11 |
15604. |       11 |
       |----------|
15605. |       11 |
15616. |        4 |
15617. |        4 |
15618. |        4 |
15619. |        4 |
       |----------|
15620. |        4 |
15627. |        4 |
15628. |        4 |
15650. |        6 |
15651. |        4 |
       |----------|
15652. |        4 |
15653. |        4 |
15654. |        4 |
15655. |        4 |
15664. |        9 |
       |----------|
15665. |        9 |
15666. |        4 |
15667. |        4 |
15697. |       12 |
15698. |       12 |
       |----------|
15699. |       12 |
15712. |       12 |
15714. |        9 |
15715. |        6 |
15722. |        4 |
       |----------|
15723. |        4 |
15730. |       12 |
15733. |       11 |
15734. |       11 |
15751. |        4 |
       |----------|
15752. |        4 |
15753. |        4 |
15754. |        4 |
15757. |       11 |
15762. |       12 |
       |----------|
15763. |       12 |
15764. |       12 |
15774. |       12 |
15775. |       12 |
15776. |       12 |
       |----------|
15782. |       11 |
15790. |        6 |
15791. |       11 |
15792. |       11 |
15797. |        . |
       |----------|
15798. |        8 |
15799. |        8 |
15815. |        9 |
15816. |        9 |
15817. |        9 |
       |----------|
15818. |        6 |
15827. |        5 |
15828. |        5 |
15829. |        5 |
15830. |        5 |
       |----------|
15831. |        5 |
15836. |        4 |
15837. |        6 |
15838. |        6 |
15839. |       12 |
       |----------|
15840. |       12 |
15844. |        6 |
15845. |        6 |
15846. |        6 |
15854. |       10 |
       |----------|
15855. |       10 |
15856. |       10 |
15865. |        4 |
15866. |        4 |
15867. |        4 |
       |----------|
15868. |        7 |
15875. |       12 |
15876. |       12 |
15877. |       12 |
15922. |       11 |
       |----------|
15941. |       12 |
15942. |       12 |
15943. |       12 |
15951. |        6 |
15952. |       11 |
       |----------|
15953. |       12 |
15954. |        1 |
15955. |       11 |
15956. |       11 |
15961. |       11 |
       |----------|
15962. |       11 |
15963. |       11 |
15964. |       11 |
15965. |       11 |
15974. |        5 |
       |----------|
15975. |        5 |
15976. |        5 |
15985. |       12 |
15986. |       12 |
15987. |       12 |
       |----------|
15988. |       12 |
15989. |       12 |
16004. |       11 |
16005. |       11 |
16006. |       11 |
       |----------|
16007. |       11 |
16021. |        6 |
16037. |       11 |
16043. |        4 |
16044. |        4 |
       |----------|
16045. |        4 |
16046. |        4 |
16047. |        4 |
16048. |        4 |
16049. |        4 |
       |----------|
16050. |        4 |
16051. |        4 |
16052. |        4 |
16053. |        4 |
16054. |        4 |
       |----------|
16078. |        4 |
16079. |        4 |
16080. |        4 |
16081. |        4 |
16082. |        4 |
       |----------|
16092. |        4 |
16104. |        4 |
16105. |       11 |
16106. |       11 |
16118. |        6 |
       |----------|
16119. |        6 |
16120. |        6 |
16121. |        6 |
16122. |        6 |
16123. |        6 |
       |----------|
16124. |        6 |
16131. |        4 |
16132. |        4 |
16133. |        4 |
16134. |        4 |
       |----------|
16135. |        4 |
16136. |        4 |
16147. |        4 |
16148. |        4 |
16149. |        4 |
       |----------|
16155. |       11 |
16156. |       11 |
16157. |        8 |
16165. |        6 |
16166. |        3 |
       |----------|
16167. |        3 |
16173. |        4 |
16174. |        4 |
16181. |        7 |
16182. |        7 |
       |----------|
16183. |        7 |
16188. |        7 |
16199. |        4 |
16200. |        4 |
16201. |        4 |
       |----------|
16202. |        4 |
16203. |        4 |
16214. |        4 |
16215. |        4 |
16216. |        4 |
       |----------|
16217. |        4 |
16218. |        4 |
16240. |        4 |
16241. |        4 |
16242. |        4 |
       |----------|
16243. |        4 |
16244. |        4 |
16271. |        5 |
16272. |       11 |
16273. |       11 |
       |----------|
16280. |        7 |
16318. |        4 |
16319. |        4 |
16320. |        4 |
16321. |        4 |
       |----------|
16322. |        4 |
16332. |        6 |
16333. |        6 |
16334. |        6 |
16335. |        . |
       |----------|
16336. |        6 |
16351. |        4 |
16352. |        4 |
16353. |        4 |
16378. |        4 |
       |----------|
16379. |        4 |
16380. |        4 |
16400. |        7 |
16401. |        7 |
16402. |        7 |
       |----------|
16403. |        7 |
16411. |       12 |
16412. |       12 |
16413. |       12 |
16414. |       12 |
       |----------|
16415. |       12 |
16416. |       12 |
16424. |        4 |
16425. |        4 |
16426. |        4 |
       |----------|
16433. |       11 |
16443. |        3 |
16444. |        3 |
16445. |        . |
16451. |       11 |
       |----------|
16452. |       11 |
16491. |        4 |
16492. |        4 |
16493. |        4 |
16505. |       11 |
       |----------|
16506. |       11 |
16507. |       11 |
16524. |       11 |
16525. |       11 |
16555. |        4 |
       |----------|
16556. |        4 |
16557. |        4 |
16570. |        4 |
16571. |        4 |
16572. |        4 |
       |----------|
16573. |        4 |
16574. |        4 |
16583. |        4 |
16584. |        4 |
16585. |        4 |
       |----------|
16586. |        4 |
16587. |        4 |
16588. |        4 |
16596. |        4 |
16597. |        4 |
       |----------|
16598. |        4 |
16599. |        4 |
16600. |        4 |
16601. |        4 |
16602. |        4 |
       |----------|
16603. |        4 |
16613. |        4 |
16614. |        4 |
16615. |        4 |
16616. |        4 |
       |----------|
16617. |        4 |
16618. |        4 |
16625. |       11 |
16626. |       11 |
16627. |       11 |
       |----------|
16628. |       12 |
16629. |       11 |
16630. |       12 |
16642. |        4 |
16643. |        6 |
       |----------|
16650. |       11 |
16651. |       11 |
16652. |       11 |
16659. |        7 |
16660. |        7 |
       |----------|
16661. |        7 |
16662. |        7 |
16673. |       11 |
16684. |       11 |
16685. |       11 |
       |----------|
16693. |        7 |
16694. |        7 |
16695. |        9 |
16696. |        7 |
16697. |       11 |
       |----------|
16698. |       11 |
16709. |        4 |
16710. |        4 |
16711. |        4 |
16712. |        4 |
       |----------|
16713. |        4 |
16723. |        9 |
16724. |        9 |
16732. |        1 |
16733. |        1 |
       |----------|
16734. |        1 |
16740. |       11 |
16753. |        4 |
16754. |        4 |
16755. |        4 |
       |----------|
16756. |       11 |
16757. |       11 |
16758. |       11 |
16767. |       11 |
16768. |       11 |
       |----------|
16769. |       11 |
16770. |       11 |
16776. |        4 |
16777. |        4 |
16778. |        6 |
       |----------|
16779. |        4 |
16780. |        4 |
16781. |        4 |
16803. |       11 |
16804. |        8 |
       |----------|
16807. |       11 |
16809. |       11 |
16810. |       11 |
16820. |        6 |
16821. |        6 |
       |----------|
16825. |        3 |
16826. |        3 |
16827. |       12 |
16828. |       11 |
16829. |       12 |
       |----------|
16830. |       12 |
16852. |       11 |
16853. |       11 |
16862. |       11 |
16863. |       11 |
       |----------|
16864. |       11 |
16875. |        2 |
16876. |        2 |
16877. |        4 |
16878. |        6 |
       |----------|
16922. |        3 |
16942. |       11 |
16943. |       11 |
16944. |       11 |
16953. |       11 |
       |----------|
16974. |        7 |
16975. |        7 |
17016. |        6 |
17017. |        6 |
17018. |        6 |
       |----------|
17019. |        6 |
17026. |       11 |
17027. |       11 |
17028. |       11 |
17029. |       11 |
       |----------|
17030. |       11 |
17031. |       11 |
17050. |       11 |
17051. |       11 |
17052. |       11 |
       |----------|
17066. |       12 |
17067. |       12 |
17068. |       12 |
17069. |       12 |
17079. |        4 |
       |----------|
17080. |        4 |
17081. |        4 |
17082. |        4 |
17083. |        4 |
17084. |        4 |
       |----------|
17106. |        4 |
17107. |        4 |
17108. |        4 |
17109. |        4 |
17110. |        4 |
       |----------|
17111. |        4 |
17112. |        4 |
17113. |        4 |
17114. |        4 |
17115. |        4 |
       |----------|
17116. |        5 |
17117. |        4 |
17133. |       12 |
17134. |       12 |
17135. |       12 |
       |----------|
17136. |        6 |
17137. |       11 |
17138. |       11 |
17139. |       11 |
17140. |       11 |
       |----------|
17141. |       11 |
17142. |       11 |
17151. |        4 |
17152. |        4 |
17153. |        4 |
       |----------|
17154. |        4 |
17155. |        4 |
17161. |       11 |
17162. |       11 |
17163. |       11 |
       |----------|
17164. |       11 |
17165. |       11 |
17166. |       11 |
17167. |       11 |
17186. |       12 |
       |----------|
17187. |       12 |
17188. |       10 |
17189. |       10 |
17196. |       11 |
17197. |       11 |
       |----------|
17198. |       11 |
17199. |       11 |
17200. |       11 |
17210. |        4 |
17211. |        4 |
       |----------|
17229. |       11 |
17253. |       11 |
17254. |       11 |
17255. |       11 |
17263. |        6 |
       |----------|
17264. |        6 |
17265. |        6 |
17296. |        9 |
17297. |        9 |
17298. |        9 |
       |----------|
17299. |        9 |
17300. |        9 |
17332. |       11 |
17333. |       11 |
17334. |       11 |
       |----------|
17335. |       11 |
17336. |       11 |
17337. |       11 |
17345. |       11 |
17346. |        . |
       |----------|
17368. |       11 |
17369. |       11 |
17370. |       11 |
17371. |       11 |
17374. |       11 |
       |----------|
17375. |       11 |
17376. |       11 |
17390. |       11 |
17391. |       11 |
17406. |        9 |
       |----------|
17407. |        9 |
17408. |        9 |
17409. |        9 |
17419. |        4 |
17420. |        4 |
       |----------|
17421. |        4 |
17422. |        4 |
17423. |        4 |
17432. |       11 |
17433. |       11 |
       |----------|
17434. |       11 |
17435. |       11 |
17436. |       11 |
17437. |       11 |
17455. |        4 |
       |----------|
17456. |        4 |
17457. |        8 |
17458. |        8 |
17467. |       12 |
17468. |       12 |
       |----------|
17469. |       12 |
17470. |       12 |
17488. |        6 |
17489. |        6 |
17490. |        6 |
       |----------|
17497. |       11 |
17498. |       11 |
17507. |        4 |
17508. |        4 |
17509. |        4 |
       |----------|
17510. |        4 |
17511. |        4 |
17512. |        4 |
17513. |        4 |
17541. |        4 |
       |----------|
17542. |        4 |
17543. |        4 |
17561. |        4 |
17562. |        4 |
17563. |        4 |
       |----------|
17564. |        4 |
17565. |        4 |
17574. |        4 |
17585. |        4 |
17586. |        4 |
       |----------|
17587. |        4 |
17598. |        4 |
17599. |        4 |
17600. |        4 |
17601. |        4 |
       |----------|
17609. |        4 |
17610. |        4 |
17611. |        4 |
17612. |        4 |
17613. |        4 |
       |----------|
17614. |        4 |
17627. |        6 |
17628. |        6 |
17629. |        6 |
17655. |        7 |
       |----------|
17656. |        7 |
17665. |        4 |
17666. |        4 |
17676. |       11 |
17677. |       11 |
       |----------|
17678. |       11 |
17679. |       11 |
17680. |       11 |
17691. |       11 |
17692. |       11 |
       |----------|
17693. |       11 |
17705. |       11 |
17706. |       11 |
17707. |       11 |
17722. |        6 |
       |----------|
17733. |        4 |
17734. |        4 |
17735. |        4 |
17740. |        6 |
17741. |        6 |
       |----------|
17742. |        6 |
17743. |        6 |
17763. |       11 |
17764. |       11 |
17765. |       11 |
       |----------|
17766. |       11 |
17767. |       11 |
17771. |       11 |
17772. |       11 |
17777. |       11 |
       |----------|
17778. |       11 |
17779. |       11 |
17780. |       11 |
17781. |       11 |
17782. |       11 |
       |----------|
17805. |        9 |
17812. |       11 |
17813. |       11 |
17814. |       11 |
17841. |        6 |
       |----------|
17842. |        6 |
17843. |        6 |
17844. |        6 |
17845. |        6 |
17859. |        7 |
       |----------|
17860. |        7 |
17861. |        7 |
17862. |        7 |
17863. |        7 |
17875. |        4 |
       |----------|
17876. |        4 |
17877. |        4 |
17891. |        4 |
17892. |        4 |
17893. |       11 |
       |----------|
17914. |       11 |
17921. |        7 |
17922. |        7 |
17923. |        7 |
17924. |        7 |
       |----------|
17925. |        7 |
17974. |        2 |
17975. |        6 |
17976. |        6 |
17983. |       11 |
       |----------|
17984. |       11 |
17985. |       11 |
17993. |       11 |
17994. |       11 |
18004. |       11 |
       |----------|
18005. |       11 |
18006. |       11 |
18007. |       11 |
18023. |       11 |
18024. |        9 |
       |----------|
18025. |       11 |
18056. |        4 |
18057. |       12 |
18058. |       12 |
18059. |       12 |
       |----------|
18081. |       11 |
18082. |       11 |
18090. |        8 |
18091. |       11 |
18113. |       11 |
       |----------|
18141. |       11 |
18142. |       11 |
18145. |        6 |
18146. |        4 |
18147. |        6 |
       |----------|
18148. |        6 |
18157. |       11 |
18158. |       11 |
18159. |       11 |
18160. |       11 |
       |----------|
18161. |       11 |
18171. |       12 |
18172. |       12 |
18173. |       12 |
18174. |       12 |
       |----------|
18175. |       12 |
18176. |       12 |
18184. |        6 |
18185. |        6 |
18186. |        6 |
       |----------|
18187. |        6 |
18195. |       11 |
18197. |       11 |
18212. |        6 |
18213. |        6 |
       |----------|
18220. |        6 |
18221. |        6 |
18229. |       11 |
18230. |       11 |
18250. |       11 |
       |----------|
18251. |       11 |
18252. |       11 |
18253. |       11 |
18276. |        4 |
18277. |        4 |
       |----------|
18278. |        4 |
18300. |        5 |
18309. |        7 |
18310. |        7 |
18330. |        4 |
       |----------|
18331. |        4 |
18332. |        4 |
18333. |        4 |
18334. |        4 |
18338. |       11 |
       |----------|
18339. |       11 |
18340. |       11 |
18353. |        5 |
18354. |       11 |
18355. |       11 |
       |----------|
18356. |       11 |
18363. |        9 |
18364. |        6 |
18365. |        9 |
18366. |        9 |
       |----------|
18390. |        7 |
18391. |        7 |
18392. |       11 |
18394. |       12 |
18395. |       11 |
       |----------|
18396. |       12 |
18397. |       11 |
18408. |        5 |
18409. |        5 |
18410. |        5 |
       |----------|
18411. |        5 |
18412. |        8 |
18422. |       11 |
18431. |       12 |
18446. |        4 |
       |----------|
18447. |        4 |
18454. |       12 |
18455. |       12 |
18456. |       11 |
18463. |       11 |
       |----------|
18474. |        6 |
18490. |        4 |
18491. |        4 |
18492. |        4 |
18503. |        6 |
       |----------|
18512. |       11 |
18513. |       11 |
18514. |       11 |
18515. |       11 |
18516. |       11 |
       |----------|
18527. |       12 |
18528. |       12 |
18529. |       12 |
18530. |        8 |
18531. |       12 |
       |----------|
18562. |       11 |
18563. |       11 |
18567. |       11 |
18568. |       11 |
18579. |        7 |
       |----------|
18580. |        9 |
18581. |        9 |
18582. |        9 |
18591. |        8 |
18592. |        8 |
       |----------|
18593. |        8 |
18594. |        7 |
18595. |        8 |
18596. |        7 |
18604. |       10 |
       |----------|
18605. |       10 |
18622. |        6 |
18623. |        6 |
18628. |        4 |
18639. |        4 |
       |----------|
18666. |        7 |
18667. |        7 |
18668. |        7 |
18669. |        7 |
18670. |        7 |
       |----------|
18693. |       11 |
18694. |       11 |
18695. |       11 |
18702. |       11 |
18713. |        7 |
       |----------|
18727. |        6 |
18728. |        6 |
18729. |        6 |
18738. |        7 |
18739. |        . |
       |----------|
18740. |       12 |
18741. |       12 |
18742. |       12 |
18756. |        4 |
18757. |        4 |
       |----------|
18758. |        4 |
18759. |        4 |
18760. |        4 |
18768. |        5 |
18769. |        5 |
       |----------|
18770. |        5 |
18779. |       11 |
18780. |       11 |
18781. |       11 |
18782. |       11 |
       |----------|
18788. |        9 |
18789. |        9 |
18790. |        9 |
18791. |        9 |
18800. |       11 |
       |----------|
18801. |       11 |
18802. |       11 |
18803. |       11 |
18804. |       11 |
18814. |       11 |
       |----------|
18815. |       11 |
18816. |       11 |
18817. |       11 |
18833. |        4 |
18836. |        6 |
       |----------|
18837. |        6 |
18853. |        4 |
18854. |        4 |
18855. |        4 |
18856. |        4 |
       |----------|
18857. |        4 |
18863. |        4 |
18864. |        4 |
18865. |        4 |
18866. |        4 |
       |----------|
18867. |        4 |
18887. |       11 |
18888. |       11 |
18889. |       11 |
18890. |       11 |
       |----------|
18913. |        7 |
18914. |        7 |
18915. |        7 |
18916. |        7 |
18917. |        7 |
       |----------|
18950. |        5 |
18966. |       11 |
18977. |       11 |
18985. |        7 |
19008. |        6 |
       |----------|
19009. |       11 |
19010. |        6 |
19011. |        6 |
19057. |        6 |
19058. |        6 |
       |----------|
19059. |        6 |
19069. |        4 |
19070. |        4 |
19071. |        4 |
19089. |        4 |
       |----------|
19090. |        4 |
19097. |        4 |
19098. |        4 |
19099. |        4 |
19100. |        4 |
       |----------|
19111. |       11 |
19112. |       11 |
19113. |        6 |
19114. |       11 |
19115. |       11 |
       |----------|
19116. |       11 |
19117. |       11 |
19127. |        4 |
19128. |        4 |
19129. |        4 |
       |----------|
19132. |       11 |
19141. |        7 |
19142. |        . |
19143. |        7 |
19144. |        7 |
       |----------|
19145. |        7 |
19147. |        9 |
19152. |       11 |
19153. |       11 |
19154. |       11 |
       |----------|
19164. |        7 |
19165. |        7 |
19166. |        7 |
19193. |        4 |
19194. |        4 |
       |----------|
19215. |       11 |
19216. |        3 |
19222. |        4 |
19223. |        4 |
19224. |        4 |
       |----------|
19235. |        4 |
19241. |       11 |
19242. |       11 |
19258. |        4 |
19259. |        4 |
       |----------|
19301. |        4 |
19302. |        4 |
19303. |        4 |
19304. |        4 |
19305. |        8 |
       |----------|
19306. |        8 |
19318. |       11 |
19319. |       11 |
19320. |       11 |
19321. |       11 |
       |----------|
19322. |        4 |
19352. |        9 |
19353. |        9 |
19354. |        9 |
19358. |       11 |
       |----------|
19359. |       11 |
19360. |       11 |
19361. |       11 |
19362. |       11 |
19363. |       11 |
       |----------|
19371. |       11 |
19384. |       11 |
19393. |        4 |
19394. |        4 |
19395. |        4 |
       |----------|
19398. |       11 |
19399. |       11 |
19400. |       11 |
19410. |        4 |
19411. |        4 |
       |----------|
19412. |        4 |
19413. |        4 |
19414. |        4 |
19415. |        4 |
19440. |        7 |
       |----------|
19450. |       12 |
19451. |        4 |
19452. |        4 |
19453. |        4 |
19454. |        4 |
       |----------|
19455. |        4 |
19456. |        4 |
19457. |        4 |
19458. |        4 |
19459. |        4 |
       |----------|
19460. |        4 |
19468. |        6 |
19469. |        6 |
19485. |        4 |
19486. |        4 |
       |----------|
19487. |        8 |
19488. |        4 |
19501. |       12 |
19502. |       12 |
19512. |        7 |
       |----------|
19513. |        7 |
19514. |        7 |
19528. |        4 |
19529. |        4 |
19530. |       11 |
       |----------|
19531. |       11 |
19532. |       11 |
19535. |        6 |
19536. |        4 |
19537. |        4 |
       |----------|
19538. |        4 |
19539. |        4 |
19542. |       11 |
19543. |       12 |
19572. |        7 |
       |----------|
19573. |        7 |
19583. |       12 |
19590. |       11 |
19591. |       11 |
19601. |        . |
       |----------|
19602. |       12 |
19617. |       11 |
19627. |        8 |
19628. |        8 |
19629. |        8 |
       |----------|
19644. |        4 |
19645. |        4 |
19646. |        4 |
19647. |        4 |
19648. |       11 |
       |----------|
19649. |       11 |
19650. |        9 |
19651. |        6 |
19652. |        6 |
19653. |        1 |
       |----------|
19654. |        6 |
19655. |        6 |
19656. |        6 |
19657. |       11 |
19658. |       11 |
       |----------|
19664. |        4 |
19665. |       11 |
19666. |       11 |
19667. |       11 |
19668. |       11 |
       |----------|
19669. |       11 |
19670. |       11 |
19671. |       11 |
19672. |       11 |
19687. |        8 |
       |----------|
19688. |        8 |
19689. |        6 |
19694. |       11 |
19695. |       11 |
19696. |       11 |
       |----------|
19701. |       11 |
19702. |       11 |
19703. |       11 |
19704. |       11 |
19705. |       11 |
       |----------|
19719. |        4 |
19720. |        6 |
19721. |        6 |
19733. |        6 |
19734. |        6 |
       |----------|
19743. |        5 |
19744. |        5 |
19767. |        4 |
19780. |        4 |
19789. |       11 |
       |----------|
19790. |       11 |
19791. |       11 |
19792. |       11 |
19794. |       11 |
19795. |        8 |
       |----------|
19797. |        7 |
19798. |        7 |
19799. |        7 |
19800. |        7 |
19812. |        7 |
       |----------|
19818. |       11 |
19819. |       11 |
19820. |       11 |
19821. |       11 |
19822. |       11 |
       |----------|
19837. |       12 |
19838. |        3 |
19847. |       11 |
19864. |        5 |
19865. |        5 |
       |----------|
19866. |        5 |
19867. |        5 |
19878. |       12 |
19882. |        4 |
19895. |        6 |
       |----------|
19896. |        6 |
19897. |        6 |
19898. |        4 |
19899. |        6 |
19936. |       11 |
       |----------|
19937. |       11 |
19938. |       11 |
19939. |        7 |
19940. |        7 |
19941. |       11 |
       |----------|
19942. |       11 |
19952. |        7 |
19953. |        7 |
19954. |        7 |
19955. |        7 |
       |----------|
19975. |       11 |
19976. |       11 |
19977. |       11 |
19978. |       11 |
19989. |        9 |
       |----------|
19990. |        7 |
20014. |        6 |
20017. |       11 |
20018. |       11 |
20019. |       11 |
       |----------|
20020. |       11 |
20021. |       11 |
20032. |       11 |
20033. |       11 |
20035. |       11 |
       |----------|
20046. |       11 |
20047. |       11 |
20048. |       11 |
20049. |       11 |
20050. |       11 |
       |----------|
20051. |       11 |
20052. |       11 |
20053. |       11 |
20054. |       11 |
20055. |       11 |
       |----------|
20056. |       11 |
20057. |       11 |
20058. |       11 |
20060. |        6 |
20061. |        6 |
       |----------|
20062. |        6 |
20063. |        6 |
20064. |        7 |
20065. |        7 |
20066. |        7 |
       |----------|
20082. |        4 |
20083. |        4 |
20098. |       11 |
20099. |       11 |
20121. |       12 |
       |----------|
20124. |        6 |
20125. |        6 |
20140. |       11 |
20141. |       11 |
20142. |        3 |
       |----------|
20143. |       11 |
20144. |       11 |
20163. |       12 |
20164. |       12 |
20165. |       12 |
       |----------|
20166. |       12 |
20167. |       12 |
20168. |       12 |
20169. |       12 |
20190. |       11 |
       |----------|
20191. |       11 |
20192. |       11 |
20193. |        7 |
20194. |        9 |
20195. |        8 |
       |----------|
20213. |        4 |
20214. |        5 |
20215. |        5 |
20229. |        7 |
20230. |        7 |
       |----------|
20231. |        7 |
20232. |        7 |
20233. |        7 |
20244. |       11 |
20245. |        4 |
       |----------|
20246. |        4 |
20255. |       12 |
20256. |        7 |
20257. |        7 |
20258. |       12 |
       |----------|
20259. |        7 |
20260. |       12 |
20265. |        6 |
20266. |        6 |
20267. |        6 |
       |----------|
20268. |        6 |
20269. |        6 |
20270. |        6 |
20285. |        6 |
20286. |        6 |
       |----------|
20287. |        6 |
20303. |       11 |
20306. |        4 |
20307. |       11 |
20308. |        5 |
       |----------|
20316. |       12 |
20317. |       12 |
20325. |        6 |
20326. |        8 |
20327. |        8 |
       |----------|
20328. |       11 |
20341. |        6 |
20342. |        5 |
20343. |        5 |
20344. |        5 |
       |----------|
20362. |       11 |
20363. |       11 |
20364. |       11 |
20365. |       11 |
20379. |        5 |
       |----------|
20390. |        6 |
20391. |        7 |
20392. |        7 |
20393. |        8 |
20394. |        5 |
       |----------|
20395. |        5 |
20402. |        4 |
20404. |       11 |
20405. |       11 |
20406. |       11 |
       |----------|
20407. |       11 |
20408. |       11 |
20409. |       11 |
20418. |        5 |
20419. |        5 |
       |----------|
20420. |        5 |
20425. |       11 |
20426. |       12 |
20427. |       12 |
20428. |       12 |
       |----------|
20429. |       12 |
20439. |       11 |
20440. |       11 |
20441. |       11 |
20442. |       11 |
       |----------|
20443. |       11 |
20444. |       11 |
20446. |       11 |
20464. |        6 |
20465. |        6 |
       |----------|
20466. |        6 |
20533. |       11 |
20534. |       11 |
20535. |       11 |
20536. |        8 |
       |----------|
20537. |        6 |
20538. |        6 |
20547. |       11 |
20548. |        5 |
20549. |        5 |
       |----------|
20554. |       12 |
20555. |       12 |
20568. |       12 |
20569. |       12 |
20570. |       12 |
       |----------|
20571. |       12 |
20572. |       12 |
20573. |       12 |
20574. |       12 |
20575. |       12 |
       |----------|
20576. |        4 |
20577. |        4 |
20578. |        4 |
20579. |        4 |
20586. |       12 |
       |----------|
20595. |        5 |
20596. |        5 |
20597. |        5 |
20598. |        5 |
20607. |       11 |
       |----------|
20608. |       11 |
20609. |        8 |
20615. |        5 |
20616. |        5 |
20617. |        5 |
       |----------|
20618. |        5 |
20619. |        5 |
20620. |        5 |
20621. |        5 |
20622. |        5 |
       |----------|
20623. |        5 |
20636. |        7 |
20637. |        7 |
20645. |        8 |
20654. |        6 |
       |----------|
20655. |        6 |
20656. |        6 |
20667. |        4 |
20668. |       12 |
20669. |       12 |
       |----------|
20678. |       11 |
20679. |       11 |
20691. |       11 |
20692. |        . |
20695. |       11 |
       |----------|
20696. |       12 |
20697. |       12 |
20698. |       12 |
20699. |       12 |
20700. |       12 |
       |----------|
20701. |       12 |
20703. |       12 |
20704. |       12 |
20706. |        9 |
20717. |       11 |
       |----------|
20721. |        6 |
20722. |        6 |
20743. |        8 |
20744. |       11 |
20747. |       11 |
       |----------|
20748. |       11 |
20766. |        5 |
20767. |        5 |
20768. |        5 |
20769. |        5 |
       |----------|
20770. |        5 |
20774. |       11 |
20775. |       11 |
20776. |       11 |
20777. |       11 |
       |----------|
20800. |       11 |
20801. |       11 |
20808. |        6 |
20809. |        6 |
20830. |        4 |
       |----------|
20831. |        4 |
20832. |        6 |
20833. |        9 |
20834. |        9 |
20842. |       11 |
       |----------|
20843. |       11 |
20844. |       11 |
20847. |       12 |
20848. |       12 |
20849. |       12 |
       |----------|
20850. |       12 |
20851. |       12 |
20852. |       11 |
20853. |       11 |
20854. |       11 |
       |----------|
20855. |       11 |
20861. |       12 |
20862. |       12 |
20863. |       12 |
20873. |        5 |
       |----------|
20879. |        7 |
20880. |        8 |
20881. |        5 |
20890. |        7 |
20891. |        7 |
       |----------|
20892. |        7 |
20893. |        7 |
20905. |        6 |
20906. |        6 |
20907. |        6 |
       |----------|
20931. |        7 |
20932. |        7 |
20952. |        7 |
20953. |        7 |
20954. |        7 |
       |----------|
20961. |       11 |
20962. |       11 |
20963. |       11 |
20964. |       11 |
20965. |        6 |
       |----------|
20966. |        6 |
20967. |       11 |
20982. |       11 |
20983. |       11 |
20984. |       11 |
       |----------|
20985. |        6 |
20988. |       11 |
20989. |       11 |
20990. |       11 |
21002. |       12 |
       |----------|
21003. |       12 |
21004. |       12 |
21005. |       12 |
21006. |       12 |
21014. |       11 |
       |----------|
21015. |       11 |
21016. |       11 |
21017. |       11 |
21035. |        5 |
21036. |        5 |
       |----------|
21037. |        5 |
21038. |        5 |
21039. |        5 |
21045. |        7 |
21046. |        7 |
       |----------|
21047. |        7 |
21048. |        7 |
21075. |        7 |
21076. |        7 |
21077. |        7 |
       |----------|
21116. |        6 |
21117. |        6 |
21154. |        8 |
21161. |       11 |
21162. |       11 |
       |----------|
21175. |       11 |
21176. |       11 |
21177. |       11 |
21184. |       12 |
21190. |       12 |
       |----------|
21191. |       12 |
21192. |       12 |
21225. |        4 |
21236. |        7 |
21237. |        7 |
       |----------|
21238. |        7 |
21268. |       11 |
21269. |       11 |
21273. |       12 |
21275. |        4 |
       |----------|
21276. |        4 |
21277. |        4 |
21285. |        6 |
21286. |        6 |
21287. |        8 |
       |----------|
21290. |       10 |
21291. |       10 |
21298. |        7 |
21299. |        7 |
21305. |       12 |
       |----------|
21306. |       12 |
21315. |        4 |
21316. |        4 |
21317. |        4 |
21318. |       12 |
       |----------|
21342. |        6 |
21343. |        6 |
21344. |        6 |
21345. |        6 |
21357. |        8 |
       |----------|
21360. |       11 |
21361. |       11 |
21362. |       11 |
21387. |       12 |
21388. |       12 |
       |----------|
21389. |       12 |
21390. |       12 |
21391. |       12 |
21392. |       12 |
21394. |       11 |
       |----------|
21395. |       11 |
21415. |       11 |
21416. |       11 |
21441. |       11 |
21442. |       11 |
       |----------|
21453. |       12 |
21458. |        4 |
21467. |       11 |
21468. |       11 |
21469. |       11 |
       |----------|
21475. |       11 |
21476. |       11 |
21478. |       11 |
21479. |       11 |
21480. |       11 |
       |----------|
21481. |        6 |
21511. |        5 |
21512. |        5 |
21513. |        5 |
21514. |        5 |
       |----------|
21515. |        5 |
21535. |       11 |
21536. |       11 |
21537. |       11 |
21540. |       11 |
       |----------|
21551. |        8 |
21552. |        4 |
21560. |       11 |
21561. |       11 |
21562. |       11 |
       |----------|
21563. |       11 |
21576. |        5 |
21577. |        5 |
21578. |        5 |
21616. |       11 |
       |----------|
21617. |       11 |
21618. |       11 |
21619. |       11 |
21620. |       11 |
21621. |       11 |
       |----------|
21629. |        4 |
21630. |        4 |
21631. |        4 |
21632. |        4 |
21651. |        4 |
       |----------|
21652. |        . |
21653. |        4 |
21673. |        4 |
21674. |        4 |
21708. |        4 |
       |----------|
21709. |        4 |
21716. |        4 |
21717. |        4 |
21720. |       12 |
21731. |        6 |
       |----------|
21732. |        6 |
21733. |        6 |
21734. |        6 |
21746. |        6 |
21747. |        6 |
       |----------|
21748. |        6 |
21749. |        6 |
21751. |       12 |
21752. |       12 |
21759. |        4 |
       |----------|
21760. |        4 |
21761. |        4 |
21762. |        4 |
21771. |       11 |
21772. |       11 |
       |----------|
21791. |        6 |
21796. |       11 |
21797. |       11 |
21798. |       11 |
21817. |        4 |
       |----------|
21818. |        4 |
21826. |       11 |
21827. |       11 |
21834. |        4 |
21835. |        4 |
       |----------|
21850. |        7 |
21853. |        8 |
21854. |        8 |
21866. |        4 |
21867. |        4 |
       |----------|
21868. |        4 |
21887. |        4 |
21888. |        4 |
21898. |       12 |
21899. |       12 |
       |----------|
21900. |       12 |
21901. |       12 |
21902. |       12 |
21903. |       12 |
21924. |        9 |
       |----------|
21925. |        9 |
21926. |        8 |
21927. |        8 |
21928. |        8 |
21929. |        8 |
       |----------|
21936. |       12 |
21937. |       12 |
21938. |       12 |
21939. |       12 |
21967. |        8 |
       |----------|
21968. |        8 |
21970. |       11 |
21971. |       11 |
21973. |        5 |
21974. |        5 |
       |----------|
21979. |       11 |
21980. |       11 |
21989. |       12 |
21990. |       11 |
21991. |       11 |
       |----------|
22014. |       11 |
22015. |       11 |
22016. |       11 |
22017. |       11 |
22018. |       11 |
       |----------|
22028. |        6 |
22033. |        7 |
22034. |        7 |
22035. |        7 |
22036. |        7 |
       |----------|
22037. |        7 |
22038. |        7 |
22049. |        7 |
22050. |        5 |
22059. |        6 |
       |----------|
22070. |        7 |
22071. |        7 |
22086. |        6 |
22087. |        6 |
22088. |        8 |
       |----------|
22089. |        8 |
22097. |       11 |
22098. |       11 |
22099. |       11 |
22100. |       11 |
       |----------|
22109. |       12 |
22110. |       12 |
22120. |       11 |
22121. |       11 |
22137. |        1 |
       |----------|
22140. |       11 |
22141. |       11 |
22149. |        6 |
22150. |        6 |
22151. |        6 |
       |----------|
22152. |        6 |
22153. |        6 |
22154. |        6 |
22179. |       11 |
22180. |       11 |
       |----------|
22181. |        6 |
22182. |        6 |
22184. |        5 |
22185. |        5 |
22197. |        4 |
       |----------|
22198. |        7 |
22199. |        7 |
22205. |       11 |
22206. |       11 |
22207. |       11 |
       |----------|
22229. |        7 |
22230. |        7 |
22231. |        7 |
22232. |        7 |
22233. |        7 |
       |----------|
22243. |        5 |
22244. |        5 |
22245. |        5 |
22246. |        5 |
22247. |        2 |
       |----------|
22257. |        1 |
22258. |       11 |
22259. |        1 |
22260. |        1 |
22261. |        1 |
       |----------|
22262. |        1 |
22271. |        4 |
22273. |       12 |
22274. |       12 |
22275. |       12 |
       |----------|
22300. |       11 |
22301. |       11 |
22302. |       11 |
22303. |       11 |
22304. |       11 |
       |----------|
22305. |       11 |
22306. |       11 |
22314. |        4 |
22315. |        4 |
22316. |        4 |
       |----------|
22358. |        4 |
22359. |        4 |
22360. |        4 |
22361. |        4 |
22362. |        4 |
       |----------|
22371. |       11 |
22372. |       11 |
22373. |       11 |
22394. |       11 |
22395. |       11 |
       |----------|
22396. |       11 |
22397. |       11 |
22398. |       11 |
22432. |       12 |
22433. |        5 |
       |----------|
22444. |        8 |
22445. |        5 |
22446. |        5 |
22495. |       12 |
22496. |       12 |
       |----------|
22497. |       12 |
22498. |       11 |
22499. |       11 |
22500. |       11 |
22539. |        5 |
       |----------|
22540. |        5 |
22541. |        . |
22542. |        5 |
22543. |        5 |
22544. |        5 |
       |----------|
22559. |        7 |
22560. |        7 |
22567. |        7 |
22584. |        9 |
22585. |        9 |
       |----------|
22586. |        4 |
22587. |        9 |
22588. |        9 |
22589. |        4 |
22603. |        4 |
       |----------|
22604. |        4 |
22605. |        4 |
22606. |        4 |
22607. |        4 |
22616. |        7 |
       |----------|
22630. |        4 |
22631. |        4 |
22642. |        6 |
22643. |        6 |
22644. |        6 |
       |----------|
22645. |        6 |
22646. |        5 |
22651. |       12 |
22652. |       12 |
22653. |       12 |
       |----------|
22663. |        9 |
22664. |       12 |
22665. |       12 |
22667. |        6 |
22677. |        5 |
       |----------|
22679. |        6 |
22690. |        6 |
22691. |        6 |
22706. |       12 |
22707. |       12 |
       |----------|
22708. |       12 |
22709. |       12 |
22718. |       11 |
22719. |       11 |
22745. |        4 |
       |----------|
22746. |        6 |
22747. |        4 |
22765. |        6 |
22766. |        6 |
22783. |        5 |
       |----------|
22798. |       11 |
22799. |       11 |
22800. |        8 |
22801. |       12 |
22802. |        8 |
       |----------|
22815. |        6 |
22816. |        6 |
22817. |        6 |
22818. |        8 |
22819. |        6 |
       |----------|
22820. |        6 |
22827. |        7 |
22828. |        7 |
22829. |        7 |
22830. |        7 |
       |----------|
22831. |        7 |
22852. |        7 |
22853. |        7 |
22854. |        7 |
22855. |        7 |
       |----------|
22856. |        7 |
22860. |       11 |
22861. |       12 |
22862. |       11 |
22863. |        . |
       |----------|
22873. |       12 |
22874. |        1 |
22875. |        1 |
22876. |        8 |
22877. |        1 |
       |----------|
22879. |       11 |
22880. |       11 |
22881. |       11 |
22882. |        5 |
22883. |        5 |
       |----------|
22884. |        5 |
22891. |        5 |
22901. |       11 |
22902. |       11 |
22903. |       11 |
       |----------|
22904. |       11 |
22905. |       11 |
22917. |       11 |
22918. |       11 |
22919. |       11 |
       |----------|
22920. |       11 |
22932. |        4 |
22933. |        . |
22934. |        4 |
22940. |       11 |
       |----------|
22961. |       11 |
22962. |       11 |
22963. |       11 |
22964. |       11 |
22965. |       11 |
       |----------|
22966. |       11 |
22973. |        4 |
22974. |        4 |
22975. |        4 |
22976. |        4 |
       |----------|
22977. |        4 |
22978. |        4 |
22979. |        4 |
22980. |        4 |
22981. |        4 |
       |----------|
23016. |        6 |
23017. |       10 |
23018. |        7 |
23019. |        7 |
23020. |        7 |
       |----------|
23022. |       11 |
23023. |       11 |
23024. |       11 |
23042. |       11 |
23050. |       11 |
       |----------|
23051. |       11 |
23052. |       11 |
23053. |       11 |
23054. |       11 |
23071. |       11 |
       |----------|
23074. |        7 |
23075. |       11 |
23076. |       11 |
23077. |       11 |
23078. |       11 |
       |----------|
23079. |       11 |
23080. |       11 |
23119. |        6 |
23133. |        5 |
23134. |       12 |
       |----------|
23146. |        7 |
23147. |        7 |
23158. |       12 |
23159. |       12 |
23163. |        5 |
       |----------|
23164. |        5 |
23165. |        5 |
23166. |        5 |
23167. |        5 |
23168. |        5 |
       |----------|
23180. |        3 |
23181. |        3 |
23182. |        6 |
23185. |        4 |
23186. |       10 |
       |----------|
23198. |        4 |
23199. |        4 |
23200. |        4 |
23212. |       11 |
23213. |       11 |
       |----------|
23214. |       11 |
23224. |       11 |
23225. |       11 |
23244. |       11 |
23245. |       11 |
       |----------|
23246. |       11 |
23255. |       11 |
23256. |       11 |
23257. |       11 |
23258. |        6 |
       |----------|
23259. |       11 |
23260. |       11 |
23264. |       11 |
23265. |       11 |
23266. |       11 |
       |----------|
23267. |       11 |
23273. |       12 |
23274. |        7 |
23287. |        4 |
23288. |        4 |
       |----------|
23289. |        4 |
23290. |        4 |
23291. |        4 |
23292. |       11 |
23293. |       11 |
       |----------|
23294. |       11 |
23295. |        6 |
23301. |       11 |
23303. |       11 |
23332. |       12 |
       |----------|
23333. |       12 |
23334. |       12 |
23343. |       11 |
23344. |       11 |
23345. |       11 |
       |----------|
23346. |       11 |
23348. |        6 |
23349. |        6 |
23350. |        6 |
23360. |        4 |
       |----------|
23361. |        4 |
23362. |        4 |
23363. |        4 |
23364. |        4 |
23382. |        7 |
       |----------|
23383. |        . |
23384. |        7 |
23385. |        7 |
23386. |        7 |
23387. |        7 |
       |----------|
23407. |       11 |
23408. |       11 |
23409. |       11 |
23410. |       11 |
23411. |       11 |
       |----------|
23430. |       11 |
23431. |       11 |
23472. |       11 |
23473. |       11 |
23474. |       11 |
       |----------|
23491. |       11 |
23492. |       12 |
23512. |       11 |
23513. |       11 |
23514. |       11 |
       |----------|
23538. |       12 |
23539. |       11 |
23540. |       12 |
23554. |       11 |
23562. |       11 |
       |----------|
23595. |        6 |
23596. |        6 |
23597. |        6 |
23598. |        6 |
23599. |        6 |
       |----------|
23606. |       11 |
23607. |       11 |
23608. |       11 |
23609. |        6 |
23610. |        6 |
       |----------|
23620. |        6 |
23621. |        6 |
23622. |        6 |
23623. |        6 |
23641. |       11 |
       |----------|
23642. |       11 |
23643. |       11 |
23654. |       12 |
23655. |       11 |
23656. |       11 |
       |----------|
23657. |       12 |
23658. |       11 |
23659. |       11 |
23665. |       11 |
23666. |       11 |
       |----------|
23667. |       11 |
23688. |        9 |
23696. |        7 |
23697. |        7 |
23698. |        7 |
       |----------|
23704. |       11 |
23705. |       11 |
23706. |       11 |
23707. |       11 |
23708. |       11 |
       |----------|
23722. |       11 |
23723. |       11 |
23724. |       11 |
23734. |       11 |
23735. |       12 |
       |----------|
23736. |       12 |
23737. |       12 |
23738. |       11 |
23740. |        6 |
23741. |        6 |
       |----------|
23746. |        5 |
23751. |       11 |
23752. |       11 |
23761. |        5 |
23762. |        5 |
       |----------|
23764. |        7 |
23765. |        7 |
23766. |        7 |
23767. |        7 |
23775. |        5 |
       |----------|
23776. |        5 |
23777. |        5 |
23778. |        5 |
23779. |        5 |
23789. |        4 |
       |----------|
23790. |        4 |
23791. |        4 |
23792. |        4 |
23793. |        4 |
23802. |        4 |
       |----------|
23803. |        4 |
23804. |        4 |
23809. |       11 |
23810. |       11 |
23813. |        6 |
       |----------|
23836. |        7 |
23837. |        7 |
23838. |        7 |
23849. |       11 |
23860. |       11 |
       |----------|
23871. |       11 |
23880. |        8 |
23881. |        6 |
23882. |        6 |
23884. |       11 |
       |----------|
23885. |       11 |
23886. |       11 |
23887. |       11 |
23891. |       11 |
23892. |       11 |
       |----------|
23903. |        4 |
23904. |        4 |
23905. |        4 |
23906. |        4 |
23907. |        4 |
       |----------|
23916. |        4 |
23917. |        4 |
23918. |        4 |
23919. |        4 |
23938. |        4 |
       |----------|
23939. |        4 |
23940. |        4 |
23947. |        4 |
23948. |        4 |
23949. |        4 |
       |----------|
23950. |        4 |
23951. |        4 |
23952. |        4 |
23953. |        4 |
23954. |        4 |
       |----------|
23967. |       11 |
23979. |       12 |
23980. |       12 |
23981. |       11 |
23986. |        5 |
       |----------|
23987. |        5 |
23988. |        5 |
23990. |        6 |
23991. |        6 |
23999. |        6 |
       |----------|
24000. |        6 |
24001. |        6 |
24009. |        7 |
24010. |        7 |
24011. |        7 |
       |----------|
24020. |       11 |
24021. |       11 |
24022. |       11 |
24023. |       11 |
24024. |       11 |
       |----------|
24033. |       12 |
24034. |       12 |
24035. |       12 |
24049. |       11 |
24058. |       12 |
       |----------|
24059. |       11 |
24060. |       12 |
24061. |       12 |
24070. |        8 |
24071. |        7 |
       |----------|
24102. |        7 |
24103. |        7 |
24104. |        7 |
24105. |       11 |
24106. |       11 |
       |----------|
24127. |        1 |
24128. |        1 |
24129. |        1 |
24130. |        1 |
24147. |        4 |
       |----------|
24148. |        4 |
24149. |        4 |
24150. |        4 |
24151. |        4 |
24152. |        4 |
       |----------|
24153. |        4 |
24171. |        4 |
24183. |        7 |
24184. |        7 |
24191. |        4 |
       |----------|
24192. |        6 |
24201. |        4 |
24226. |        4 |
24227. |        4 |
24237. |        4 |
       |----------|
24238. |        4 |
24239. |        4 |
24262. |       12 |
24263. |       12 |
24264. |       12 |
       |----------|
24291. |       11 |
24292. |       11 |
24293. |       11 |
24304. |        4 |
24305. |        4 |
       |----------|
24306. |        6 |
24316. |        4 |
24317. |        4 |
24318. |        6 |
24319. |        3 |
       |----------|
24320. |       11 |
24326. |        4 |
24327. |        4 |
24378. |        6 |
24379. |       11 |
       |----------|
24398. |        6 |
24399. |        4 |
24400. |        6 |
24401. |       11 |
24402. |        6 |
       |----------|
24413. |        7 |
24414. |        7 |
24436. |       11 |
24437. |       11 |
24460. |       11 |
       |----------|
24477. |        4 |
24478. |        4 |
24479. |        4 |
24480. |        4 |
24481. |        4 |
       |----------|
24494. |       11 |
24495. |       11 |
24508. |        9 |
24509. |        9 |
24510. |        9 |
       |----------|
24511. |       11 |
24512. |       11 |
24531. |        9 |
24532. |        9 |
24533. |        9 |
       |----------|
24534. |        9 |
24535. |        9 |
24536. |        9 |
24537. |        9 |
24541. |        9 |
       |----------|
24542. |        9 |
24543. |        9 |
24544. |        9 |
24558. |       11 |
24563. |        6 |
       |----------|
24564. |        9 |
24574. |        4 |
24575. |        4 |
24582. |       11 |
24594. |       11 |
       |----------|
24595. |       11 |
24599. |       11 |
24600. |       11 |
24601. |       11 |
24602. |       11 |
       |----------|
24603. |       11 |
24610. |        8 |
24623. |        5 |
24624. |        6 |
24626. |       11 |
       |----------|
24627. |        4 |
24628. |        4 |
24645. |        6 |
24646. |        6 |
24647. |        6 |
       |----------|
24648. |        6 |
24665. |        7 |
24666. |        7 |
24667. |        7 |
24668. |        7 |
       |----------|
24669. |        7 |
24670. |        7 |
24671. |        7 |
24672. |        7 |
24680. |        6 |
       |----------|
24681. |        6 |
24705. |        4 |
24706. |        4 |
24723. |        4 |
24724. |        4 |
       |----------|
24745. |        6 |
24769. |        5 |
24770. |        5 |
24771. |        5 |
24772. |        5 |
       |----------|
24790. |        5 |
24791. |        5 |
24799. |        7 |
24800. |        7 |
24801. |        7 |
       |----------|
24802. |        7 |
24803. |        7 |
24804. |        7 |
24805. |        7 |
24812. |        6 |
       |----------|
24813. |        6 |
24842. |       11 |
24843. |       11 |
24844. |       11 |
24845. |       11 |
       |----------|
24854. |       11 |
24863. |        8 |
24864. |        8 |
24873. |        6 |
24884. |        4 |
       |----------|
24924. |        8 |
24925. |        8 |
24941. |        9 |
24942. |        9 |
24943. |        9 |
       |----------|
24944. |        9 |
24945. |        9 |
24955. |        4 |
24956. |        4 |
24957. |        4 |
       |----------|
24958. |        4 |
24959. |        4 |
24966. |        4 |
24976. |        3 |
24977. |       11 |
       |----------|
24978. |       11 |
24995. |       11 |
24996. |       11 |
24999. |        7 |
25000. |        7 |
       |----------|
25009. |        4 |
25010. |        4 |
25011. |        1 |
25012. |        1 |
25013. |        7 |
       |----------|
25022. |        7 |
25023. |        7 |
25024. |        7 |
25035. |        7 |
25036. |        7 |
       |----------|
25037. |        4 |
25048. |        4 |
25049. |        4 |
25050. |        4 |
25060. |        4 |
       |----------|
25061. |        4 |
25062. |        4 |
25063. |        4 |
25074. |        3 |
25084. |       11 |
       |----------|
25085. |       11 |
25086. |       11 |
25087. |       11 |
25091. |       11 |
25092. |       11 |
       |----------|
25093. |       11 |
25102. |        8 |
25103. |        8 |
25104. |       12 |
25105. |       12 |
       |----------|
25112. |        6 |
25113. |        6 |
25114. |        6 |
25115. |       12 |
25122. |        6 |
       |----------|
25123. |        6 |
25132. |       12 |
25133. |       12 |
25134. |       12 |
25135. |       12 |
       |----------|
25136. |       12 |
25160. |        9 |
25175. |       11 |
25176. |       11 |
25177. |        8 |
       |----------|
25178. |        8 |
25179. |        4 |
25200. |        4 |
25201. |        4 |
25214. |        6 |
       |----------|
25215. |        6 |
25224. |       12 |
25225. |       12 |
25226. |       12 |
25228. |       11 |
       |----------|
25229. |       11 |
25230. |       11 |
25231. |       11 |
25232. |       11 |
25233. |       11 |
       |----------|
25234. |        4 |
25266. |       11 |
25274. |       12 |
25275. |       11 |
25284. |       11 |
       |----------|
25285. |       11 |
25286. |       11 |
25298. |        4 |
25299. |        4 |
25300. |        4 |
       |----------|
25307. |        5 |
25308. |        5 |
25315. |        7 |
25316. |        4 |
25317. |       12 |
       |----------|
25319. |        8 |
25323. |       12 |
25353. |       12 |
25354. |       12 |
25367. |        5 |
       |----------|
25368. |        5 |
25369. |        5 |
25370. |        5 |
25371. |        5 |
25372. |        5 |
       |----------|
25389. |        7 |
25390. |        7 |
25391. |        7 |
25392. |        7 |
25393. |        7 |
       |----------|
25394. |       11 |
25400. |        9 |
25401. |       11 |
25402. |       11 |
25403. |       11 |
       |----------|
25404. |       11 |
25418. |        7 |
25423. |        9 |
25424. |        9 |
25425. |        5 |
       |----------|
25455. |        4 |
25456. |        4 |
25457. |        4 |
25465. |        5 |
25477. |       11 |
       |----------|
25478. |       11 |
25479. |       11 |
25492. |        6 |
25501. |        4 |
25502. |        4 |
       |----------|
25503. |        4 |
25517. |        5 |
25518. |        5 |
25519. |        5 |
25529. |       12 |
       |----------|
25530. |       12 |
25531. |       12 |
25532. |       12 |
25533. |       12 |
25557. |        7 |
       |----------|
25558. |        9 |
25563. |       11 |
25564. |       11 |
25571. |       11 |
25572. |       11 |
       |----------|
25573. |       11 |
25576. |       12 |
25577. |       11 |
25592. |       11 |
25593. |       11 |
       |----------|
25594. |       11 |
25613. |        4 |
25614. |        4 |
25615. |        4 |
25625. |        4 |
       |----------|
25626. |        4 |
25627. |        4 |
25628. |        4 |
25631. |       11 |
25632. |       11 |
       |----------|
25673. |        4 |
25674. |        4 |
25675. |        4 |
25684. |        8 |
25701. |        4 |
       |----------|
25702. |        4 |
25703. |        4 |
25704. |        4 |
25709. |        4 |
25710. |        4 |
       |----------|
25711. |        8 |
25712. |        8 |
25731. |        6 |
25732. |        6 |
25753. |       11 |
       |----------|
25754. |       11 |
25764. |        6 |
25765. |        6 |
25770. |        7 |
25783. |       11 |
       |----------|
25784. |       11 |
25785. |       11 |
25803. |       11 |
25804. |       11 |
25808. |        4 |
       |----------|
25809. |       11 |
25810. |       11 |
25811. |       11 |
25812. |       11 |
25813. |       11 |
       |----------|
25814. |       11 |
25815. |       11 |
25816. |       11 |
25817. |       11 |
25838. |       11 |
       |----------|
25839. |       11 |
25846. |        4 |
25847. |        4 |
25848. |        4 |
25849. |        4 |
       |----------|
25850. |        4 |
25851. |        4 |
25862. |       11 |
25863. |       11 |
25864. |       11 |
       |----------|
25873. |        9 |
25874. |        9 |
25883. |        6 |
25884. |        6 |
25894. |        4 |
       |----------|
25895. |        6 |
25896. |        6 |
25897. |        6 |
25898. |        6 |
25905. |        4 |
       |----------|
25906. |        4 |
25917. |       11 |
25918. |       12 |
25925. |       11 |
25926. |       11 |
       |----------|
25945. |       11 |
25946. |       11 |
25947. |       11 |
25949. |        4 |
25950. |        4 |
       |----------|
25951. |       11 |
25968. |       12 |
25969. |       12 |
25970. |       12 |
25977. |       11 |
       |----------|
25978. |       11 |
25992. |        9 |
25993. |        9 |
26030. |        6 |
26031. |        6 |
       |----------|
26032. |        6 |
26033. |        6 |
26034. |        6 |
26073. |       11 |
26074. |       11 |
       |----------|
26075. |       11 |
26076. |       11 |
26077. |       11 |
26094. |       12 |
26100. |       11 |
       |----------|
26101. |       11 |
26120. |        6 |
26121. |        6 |
26122. |        6 |
26123. |        6 |
       |----------|
26157. |       11 |
26158. |       11 |
26171. |        5 |
26172. |       12 |
26173. |       12 |
       |----------|
26199. |        5 |
26200. |       11 |
26201. |       11 |
26219. |        7 |
26220. |        7 |
       |----------|
26221. |        7 |
26222. |        7 |
26223. |        7 |
26238. |       11 |
26239. |       11 |
       |----------|
26240. |       11 |
26250. |        7 |
26258. |       11 |
26276. |       11 |
26282. |       11 |
       |----------|
26290. |       12 |
26291. |       12 |
26302. |       11 |
26303. |       11 |
26304. |       11 |
       |----------|
26314. |       11 |
26315. |       11 |
26316. |       11 |
26317. |       11 |
26318. |       11 |
       |----------|
26328. |       11 |
26329. |       11 |
26330. |       11 |
26340. |        6 |
26341. |        6 |
       |----------|
26342. |        6 |
26349. |       11 |
26350. |       11 |
26351. |       11 |
26352. |       11 |
       |----------|
26367. |        6 |
26368. |        6 |
26369. |        6 |
26379. |        6 |
26380. |        6 |
       |----------|
26381. |        6 |
26389. |       11 |
26390. |       11 |
26391. |       11 |
26430. |        5 |
       |----------|
26431. |        5 |
26432. |        5 |
26433. |        5 |
26474. |        9 |
26475. |        9 |
       |----------|
26506. |       11 |
26507. |       11 |
26528. |       11 |
26535. |        7 |
26536. |        7 |
       |----------|
26550. |        7 |
26551. |        7 |
26552. |        7 |
26558. |        8 |
26559. |        8 |
       |----------|
26574. |        7 |
26586. |        6 |
26587. |        6 |
26588. |        6 |
26589. |        6 |
       |----------|
26590. |        6 |
26591. |        6 |
26620. |        4 |
26621. |        4 |
26622. |        4 |
       |----------|
26623. |        4 |
26633. |        4 |
26634. |        4 |
26635. |       11 |
26636. |       11 |
       |----------|
26637. |       11 |
26647. |       11 |
26656. |       11 |
26657. |       11 |
26658. |       11 |
       |----------|
26684. |        6 |
26685. |        6 |
26686. |        6 |
26687. |        6 |
26688. |        6 |
       |----------|
26689. |        7 |
26690. |        7 |
26691. |       11 |
26692. |       11 |
26701. |        6 |
       |----------|
26735. |        6 |
26746. |        7 |
26747. |       12 |
26769. |        6 |
26770. |        6 |
       |----------|
26771. |        6 |
26772. |        6 |
26786. |       11 |
26795. |       12 |
26796. |       12 |
       |----------|
26807. |        4 |
26808. |        4 |
26809. |        4 |
26810. |        4 |
26811. |        . |
       |----------|
26819. |        4 |
26837. |        4 |
26846. |        4 |
26847. |        4 |
26848. |        4 |
       |----------|
26850. |        4 |
26866. |        4 |
26867. |        4 |
26868. |        4 |
26869. |        4 |
       |----------|
26870. |        4 |
26877. |        9 |
26878. |        9 |
26879. |        4 |
26886. |       11 |
       |----------|
26887. |       11 |
26888. |       11 |
26889. |       11 |
26898. |       11 |
26899. |       11 |
       |----------|
26900. |       11 |
26901. |        8 |
26911. |        7 |
26912. |        7 |
26913. |        7 |
       |----------|
26914. |        7 |
26915. |        7 |
26924. |        6 |
26925. |        6 |
26926. |        6 |
       |----------|
26927. |        6 |
26928. |        6 |
26954. |        9 |
26955. |        9 |
26961. |       11 |
       |----------|
26962. |       11 |
26979. |       11 |
26980. |        6 |
26981. |        4 |
26992. |        4 |
       |----------|
26993. |        4 |
26994. |        4 |
26995. |        4 |
26996. |        4 |
27004. |        4 |
       |----------|
27005. |        4 |
27006. |        4 |
27007. |        4 |
27015. |        4 |
27016. |        4 |
       |----------|
27017. |        4 |
27025. |        9 |
27026. |        9 |
27027. |        9 |
27036. |        4 |
       |----------|
27041. |        4 |
27045. |       11 |
27054. |        4 |
27055. |        4 |
27066. |        6 |
       |----------|
27067. |        6 |
27068. |        6 |
27088. |       11 |
27089. |       11 |
27090. |       11 |
       |----------|
27091. |       11 |
27092. |       11 |
27120. |       12 |
27121. |       11 |
27141. |       11 |
       |----------|
27142. |       11 |
27143. |       11 |
27144. |       11 |
27145. |       11 |
27146. |       11 |
       |----------|
27147. |       11 |
27148. |       11 |
27151. |       11 |
27152. |       11 |
27153. |       11 |
       |----------|
27154. |        6 |
27163. |        4 |
27213. |        5 |
27214. |        5 |
27215. |        5 |
       |----------|
27216. |        5 |
27224. |        4 |
27225. |        4 |
27226. |        4 |
27262. |        6 |
       |----------|
27263. |        6 |
27264. |        6 |
27269. |       11 |
27270. |       11 |
27279. |        4 |
       |----------|
27288. |        4 |
27289. |        4 |
27290. |        4 |
27291. |        4 |
27299. |        5 |
       |----------|
27300. |        5 |
27307. |        4 |
27308. |        4 |
27309. |        4 |
27310. |        4 |
       |----------|
27311. |        4 |
27319. |        4 |
27320. |        4 |
27327. |       11 |
27328. |       11 |
       |----------|
27329. |       11 |
27333. |       11 |
27354. |       11 |
27355. |       11 |
27388. |        4 |
       |----------|
27389. |        6 |
27390. |        4 |
27391. |        4 |
27392. |        4 |
27400. |        4 |
       |----------|
27401. |        4 |
27402. |        8 |
27403. |        4 |
27408. |       11 |
27409. |       11 |
       |----------|
27410. |       11 |
27411. |       11 |
27415. |        4 |
27416. |        4 |
27417. |        4 |
       |----------|
27435. |       11 |
27436. |       11 |
27441. |        4 |
27442. |        4 |
27443. |        4 |
       |----------|
27444. |       11 |
27445. |       11 |
27446. |       11 |
27447. |       11 |
27448. |       11 |
       |----------|
27449. |        4 |
27450. |        6 |
27451. |        6 |
27461. |       11 |
27476. |        8 |
       |----------|
27477. |        8 |
27478. |        8 |
27489. |       11 |
27490. |       11 |
27491. |       11 |
       |----------|
27492. |       11 |
27505. |        8 |
27506. |        6 |
27507. |        6 |
27508. |        6 |
       |----------|
27509. |        6 |
27514. |        6 |
27515. |        6 |
27516. |        6 |
27517. |        6 |
       |----------|
27518. |        6 |
27520. |        4 |
27521. |        4 |
27522. |       11 |
27523. |        8 |
       |----------|
27530. |       11 |
27531. |       11 |
27532. |       11 |
27533. |       11 |
27543. |        6 |
       |----------|
27544. |        6 |
27545. |        6 |
27571. |        7 |
27572. |        7 |
27573. |        7 |
       |----------|
27574. |        7 |
27575. |        7 |
27582. |       11 |
27583. |       11 |
27584. |       11 |
       |----------|
27618. |        4 |
27619. |        4 |
27620. |        4 |
27621. |        4 |
27622. |        4 |
       |----------|
27623. |        4 |
27665. |       11 |
27666. |       11 |
27667. |       11 |
27695. |        6 |
       |----------|
27696. |        6 |
27697. |        6 |
27698. |        8 |
27712. |        1 |
27713. |        1 |
       |----------|
27718. |        4 |
27719. |        4 |
27720. |        4 |
27728. |        8 |
27729. |        8 |
       |----------|
27730. |        6 |
27755. |        9 |
27756. |        9 |
27767. |       12 |
27768. |       12 |
       |----------|
27769. |       12 |
27770. |       12 |
27771. |       12 |
27781. |       11 |
27782. |       11 |
       |----------|
27783. |       11 |
27784. |       11 |
27785. |       11 |
27788. |        9 |
27797. |        7 |
       |----------|
27798. |        7 |
27799. |        7 |
27800. |        7 |
27801. |        7 |
27802. |        7 |
       |----------|
27806. |        4 |
27815. |        7 |
27816. |        7 |
27817. |        6 |
27818. |        6 |
       |----------|
27819. |        8 |
27820. |        7 |
27821. |        7 |
27822. |        7 |
27832. |        3 |
       |----------|
27833. |        3 |
27834. |        3 |
27835. |        3 |
27836. |        3 |
27837. |       12 |
       |----------|
27838. |       11 |
27839. |       11 |
27846. |       11 |
27847. |       11 |
27848. |       11 |
       |----------|
27859. |        1 |
27866. |       10 |
27867. |        6 |
27868. |       11 |
27869. |        . |
       |----------|
27873. |        6 |
27874. |        6 |
27875. |       11 |
27876. |       11 |
27883. |       12 |
       |----------|
27884. |       12 |
27885. |       11 |
27888. |       11 |
27889. |       11 |
27890. |       11 |
       |----------|
27912. |       12 |
27917. |        9 |
27919. |        7 |
27927. |       11 |
27928. |       11 |
       |----------|
27929. |       11 |
27930. |       11 |
27938. |        7 |
27939. |        7 |
27940. |        7 |
       |----------|
27951. |       11 |
27952. |       11 |
27953. |       11 |
27954. |       11 |
27960. |        3 |
       |----------|
27961. |        3 |
27962. |        3 |
27963. |        3 |
27964. |       12 |
27965. |       12 |
       |----------|
27966. |       12 |
27967. |       12 |
27977. |        7 |
27978. |        7 |
27979. |        7 |
       |----------|
27980. |        7 |
27981. |        7 |
27982. |        7 |
28015. |        9 |
28016. |        9 |
       |----------|
28017. |        9 |
28018. |        9 |
28028. |       11 |
28029. |       11 |
28030. |       11 |
       |----------|
28031. |       11 |
28053. |        4 |
28054. |        4 |
28060. |       11 |
28061. |       11 |
       |----------|
28062. |       11 |
28063. |       11 |
28064. |       11 |
28067. |       12 |
28068. |       12 |
       |----------|
28069. |       12 |
28079. |        6 |
28094. |       11 |
28114. |       12 |
28115. |       12 |
       |----------|
28116. |       11 |
28117. |       11 |
28149. |       11 |
28150. |       11 |
28151. |       11 |
       |----------|
28168. |       11 |
28176. |        4 |
28177. |        4 |
28178. |        4 |
28179. |        4 |
       |----------|
28188. |        4 |
28189. |        4 |
28190. |        4 |
28211. |        4 |
28224. |        4 |
       |----------|
28225. |        4 |
28226. |        4 |
28245. |       11 |
28253. |       12 |
28254. |       12 |
       |----------|
28255. |       12 |
28256. |       12 |
28257. |       12 |
28268. |       11 |
28269. |       11 |
       |----------|
28270. |       11 |
28271. |       11 |
28272. |       11 |
28282. |        4 |
28283. |        4 |
       |----------|
28284. |        9 |
28305. |       12 |
28306. |       12 |
28307. |       12 |
28322. |       11 |
       |----------|
28323. |       11 |
28324. |       11 |
28325. |       11 |
28326. |       11 |
28327. |       11 |
       |----------|
28328. |       11 |
28329. |       11 |
28330. |       11 |
28331. |       11 |
28343. |        4 |
       |----------|
28344. |        4 |
28352. |        4 |
28365. |        3 |
28366. |        2 |
28403. |        4 |
       |----------|
28404. |        4 |
28405. |        4 |
28406. |        4 |
28411. |       11 |
28412. |       11 |
       |----------|
28413. |       11 |
28428. |       11 |
28432. |       11 |
28433. |       11 |
28481. |       11 |
       |----------|
28482. |       11 |
28488. |       11 |
28489. |       11 |
28490. |       11 |
28497. |       11 |
       |----------|
28498. |       11 |
28499. |       11 |
28511. |        8 |
28512. |        8 |
28513. |        5 |
       |----------|
28514. |        8 |
28515. |        6 |
28516. |        8 |
28525. |       11 |
28534. |       11 |
       +----------+

. 
. * show the unique values of a variable (only do this for low dimension, discrete
. * variables)
. levelsof race
1 2 3

. 
. * frequency counts for distinct values of a variable
. tabulate race

       Race |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     20,180       70.72       70.72
      Black |      8,051       28.22       98.94
      Other |        303        1.06      100.00
------------+-----------------------------------
      Total |     28,534      100.00

. 
. * calculate summary statistics by a grouping variable
. * see `help tabstat` for usage and a list of possible statistics
. tabstat ln_wage age union, by(collgrad) stat(n mean sd min p25 median p75 max)

Summary statistics: N, Mean, SD, Min, p25, p50, p75, Max
Group variable: collgrad (1 if college graduate)

collgrad |   ln_wage       age     union
---------+------------------------------
       0 |     23739     23717     15480
         |  1.600027  28.56217   .220478
         |   .444571  6.762262  .4145824
         |         0        14         0
         |  1.321256        23         0
         |  1.575037        28         0
         |   1.85806        34         0
         |  5.263916        46         1
---------+------------------------------
       1 |      4795      4793      3758
         |  2.045621   31.4348  .2919106
         |  .4653516  5.825077  .4547019
         |  .0240972        19         0
         |  1.765517        26         0
         |  2.055405        31         0
         |  2.324879        36         1
         |   4.49981        46         1
---------+------------------------------
   Total |     28534     28510     19238
         |  1.674907  29.04511  .2344319
         |  .4780935  6.700584  .4236542
         |         0        14         0
         |  1.361496        23         0
         |  1.640541        28         0
         |  1.964083        34         0
         |  5.263916        46         1
----------------------------------------

. tabstat ln_wage msp nev_mar collgrad grade ttl_exp, by(year) stat(n mean sd min p25 median p7
> 5 max)

Summary statistics: N, Mean, SD, Min, p25, p50, p75, Max
Group variable: year (Interview year)

    year |   ln_wage       msp   nev_mar  collgrad     grade   ttl_exp
---------+------------------------------------------------------------
      68 |      1375      1375      1375      1375      1375      1375
         |   1.44136  .4618182  .4574545  .0676364  11.78473  .8714312
         |  .3884235  .4987214  .4983679  .2512122  1.895041  .8417328
         |  .0176546         0         0         0         0         0
         |  1.270418         0         0         0        12  .4166667
         |  1.464574         0         0         0        12  .8076923
         |  1.685361         1         1         0        12         1
         |  2.853805         1         1         1        18      11.5
---------+------------------------------------------------------------
      69 |      1232      1232      1232      1232      1232      1232
         |  1.531032  .4667208  .4310065  .0649351  11.81169   1.55072
         |  .3766929  .4990939  .4954181  .2465113  1.850267  .9792921
         |  .0240972         0         0         0         0         0
         |  1.361601         0         0         0        12  .9230769
         |  1.517537         0         0         0        12  1.554487
         |  1.754106         1         1         0        12         2
         |  3.204134         1         1         1        18  8.416667
---------+------------------------------------------------------------
      70 |      1686      1686      1686      1686      1686      1686
         |  1.507048  .5284698  .3795967  .0765125  11.89087   2.02444
         |  .3984743  .4993369  .4854305  .2658952  1.955881  1.189391
         |  .0240972         0         0         0         0         0
         |  1.316302         0         0         0        12  1.166667
         |  1.517537         1         0         0        12  2.038461
         |  1.758581         1         1         0        12  2.769231
         |  3.005013         1         1         1        18  13.55769
---------+------------------------------------------------------------
      71 |      1851      1851      1851      1851      1851      1851
         |  1.546859  .5537547  .3581848  .0842788  11.97731   2.57178
         |   .414415  .4972364  .4795964  .2778805  1.910009   1.45186
         |  .0253174         0         0         0         1         0
         |  1.316866         0         0         0        12       1.5
         |  1.542669         1         0         0        12  2.596154
         |  1.805034         1         1         0        12  3.538462
         |  3.285639         1         1         1        18  14.53846
---------+------------------------------------------------------------
      72 |      1693      1693      1693      1693      1693      1693
         |  1.567283  .5569994  .3461311  .0974601  12.08151  3.123832
         |  .4319477  .4968872  .4758762  .2966709  1.956191  1.727268
         |  .0682788         0         0         0         0  .0833333
         |  1.297919         0         0         0        12  1.769231
         |  1.572356         1         0         0        12  3.128205
         |  1.848051         1         1         0        12  4.378205
         |  4.242752         1         1         1        18  15.53846
---------+------------------------------------------------------------
      73 |      1981      1981      1981      1981      1981      1981
         |  1.578448  .6057547  .2892479   .116103  12.20242  3.599215
         |  .4297621  .4888114  .4535277  .3204293  1.988836  1.923745
         |  .0080322         0         0         0         1         0
         |  1.316365         0         0         0        12  2.076923
         |  1.572356         1         0         0        12  3.551282
         |  1.843231         1         1         0        12  4.980769
         |  3.757158         1         1         1        18  16.55769
---------+------------------------------------------------------------
      75 |      2141      2141      2141      2141      2141      2141
         |  1.579865  .6300794  .2326016  .1466604  12.33489  4.128193
         |  .4077728  .4828957   .422589  .3538497  2.203532  2.114879
         |  .0622126         0         0         0         0  .0833333
         |  1.289716         0         0         0        12  2.474359
         |  1.571567         1         0         0        12  3.980769
         |  1.846004         1         0         0        13  5.653846
         |  3.925446         1         1         1        18  17.55769
---------+------------------------------------------------------------
      77 |      2171      2166      2166      2171      2171      2171
         |  1.658813   .645891  .2059095  .1920774  12.56149  4.885767
         |  .4308272  .4783528   .404458  .3940243  2.429707  2.379498
         |  .0044871         0         0         0         0  .0961538
         |  1.344972         0         0         0        12  3.083333
         |  1.646234         1         0         0        12      4.75
         |   1.93536         1         0         0        14   6.48718
         |  3.623841         1         1         1        18  17.55769
---------+------------------------------------------------------------
      78 |      1964      1953      1953      1964      1964      1964
         |   1.71629  .6395289  .1971326  .2077393  12.70316  5.697941
         |  .4327877  .4802601  .3979352  .4057925  2.445112  2.578189
         |  .0684925         0         0         0         0  .0961538
         |  1.416566         0         0         0        12  3.833333
         |  1.699692         1         0         0        12  5.557693
         |  1.999893         1         0         0        14  7.419872
         |  4.029306         1         1         1        18  18.57692
---------+------------------------------------------------------------
      80 |      1847      1847      1847      1847      1847      1847
         |  1.729773  .6296697  .1672983  .2116946  12.79913  7.022073
         |  .4442248  .4830239  .3733431  .4086201  2.444229  2.974137
         |  .1438704         0         0         0         0  .0833333
         |  1.396633         0         0         0        12         5
         |  1.702015         1         0         0        12  6.967948
         |  2.012591         1         0         0        14  9.051282
         |  4.199647         1         1         1        18  20.46795
---------+------------------------------------------------------------
      82 |      2085      2085      2085      2085      2085      2085
         |  1.726432  .6369305  .1410072  .2091127  12.80432  8.132174
         |    .46796      .481  .3481125  .4067726  2.473871  3.327602
         |         0         0         0         0         0  .0384615
         |  1.386294         0         0         0        12  5.788462
         |  1.702928         1         0         0        12      8.25
         |  2.024193         1         0         0        14  10.51282
         |  4.254619         1         1         1        18      22.5
---------+------------------------------------------------------------
      83 |      1987      1987      1987      1987      1987      1987
         |  1.768276  .6260695  .1383996   .224459  12.94615  8.982279
         |  .5140673  .4839673  .3454058  .4173306  2.515935  3.520721
         |         0         0         0         0         0  .0833333
         |  1.406737         0         0         0        12  6.692308
         |  1.738154         1         0         0        12  9.121796
         |  2.105749         1         0         0        15  11.49359
         |  4.828314         1         1         1        18  23.46154
---------+------------------------------------------------------------
      85 |      2085      2085      2085      2085      2085      2085
         |  1.831842  .6398082  .1213429  .2311751  13.04317  10.34531
         |  .5063103  .4801711  .3266037  .4216852  2.478324  3.920763
         |  .0300107         0         0         0         3  .0576923
         |  1.489636         0         0         0        12  7.455128
         |  1.818867         1         0         0        12  10.57692
         |  2.192834         1         0         0        15   13.1859
         |  4.025415         1         1         1        18  25.46154
---------+------------------------------------------------------------
      87 |      2164      2164      2164      2164      2164      2164
         |  1.841969  .6451017   .107671   .237061  13.10721  11.64828
         |  .5201446  .4785931  .3100361  .4253783  2.451294  4.287163
         |  .0441609         0         0         0         2  .0961538
         |  1.432453         0         0         0        12  8.461538
         |   1.83592         1         0         0        12  12.11539
         |  2.213443         1         0         0        15  14.84295
         |  4.005049         1         1         1        18  27.46154
---------+------------------------------------------------------------
      88 |      2272      2272      2272      2272      2270      2272
         |  1.879937  .6439261  .1034331  .2354754  13.09692   12.5267
         |  .5960048  .4789428  .3045908   .424389  2.515766  4.610908
         |  .0049397         0         0         0         0  .1153846
         |  1.452867         0         0         0        12  9.208333
         |  1.837401         1         0         0        12  13.10256
         |  2.267026         1         0         0        15  15.98718
         |  5.263916         1         1         1        18  28.88461
---------+------------------------------------------------------------
   Total |     28534     28518     28518     28534     28532     28534
         |  1.674907  .6029175  .2296795  .1680451  12.53259  6.215316
         |  .4780935  .4893019  .4206341  .3739129  2.323905  4.652117
         |         0         0         0         0         0         0
         |  1.361496         0         0         0        12  2.461539
         |  1.640541         1         0         0        12  5.057693
         |  1.964083         1         0         0        14  9.128204
         |  5.263916         1         1         1        18  28.88461
----------------------------------------------------------------------

. 
. * plot histogram of variable
. histogram ln_wage, frequency
(bin=44, start=0, width=.11963445)

. 
. log close
      name:  <unnamed>
       log:  /home/sam/repos/econ513/03_explore.log
  log type:  text
 closed on:  30 Aug 2022, 16:27:32
-----------------------------------------------------------------------------------------------
